content/reading-note/c++-primer-notes.org
# -*- coding:utf-8-*-
#+TITLE: 《C++ Primer》读书笔记
#+AUTHOR: liushangliang
#+EMAIL: phenix3443+github@gmail.com

* 第 1 章 开始
** 1.2
   endl 是一个被称为操纵符（manipulator）的特殊值。写入 endl 的效果是结束当前行，并将与设备相关的缓冲区中的内容刷新到设备中。

** 1.4.3
   使用 istream 对象作为条件时，其效果是检测流的状态：
   #+BEGIN_SRC c++
while(std::cin >> value) {

}
   #+END_SRC

* 第 2 章 变量和基本类型
** 2.1.1 算数类型
   可寻址的最小内存块称为“字节”，存储的基本单元称为“字”。

   C++ 标准指定了浮点数 *有效位数* 最小值，通常 float 以 1 个字（32 比特）来表示，double 以 2 个字（64 比特）表示。

   为什么整数规定的存储所用的内存，而浮点数规定的有效位数呢，这是由于二者在内存中的存储方式不同导致的。[fn:1]

   与其他整型不同，字符型分为了三种：char、signed char、unsigned char。尽管字符型有三种，但是表现形式只有两种：带符号和无符号的。类型 char 实际上会表现为哪种有编译器确定。

   执行浮点运算选择 double，因为精度更高，计算代价和 float 差不多，有的机器甚至更快。

** 2.1.2 类型转换
   自动进行类型转换。类型转换规则中需要注意的地方：
   + 浮点数赋给整数，结果仅保留浮点数的整数部分。
   + 赋值给无符号类型超过其表示范围时，结果是初始值对无符号类型表示数取模后的余数。
   + 赋值给带符号类型超过其表示范围时，结果是未定义的。
   + 带符号和无符号混用，带符号数自动转换为无符号数。 *不要混用带符号类型和无符号类型*

** 2.1.3 字面量常量
   默认情况下，十进制字面值是带符号数，八进制和十六进制字面值既可能是带符号的，也可能是无符号的。

   十进制字面值的类型是 int、long、long long 中能容纳其值的最小者。

   八进制和十六进制字面值的类型是能容纳其数值的 int、unsigned int、long、unsigned long、long long、unsigned long long 中的尺寸最小者。如果放不下，报错。

   short 没有对应的字面值。

   浮点型字面值是一个 double。

   单引号括起来的是字符，双引号括起来的是字符串。

   如果两个字符串字面值位置紧邻且仅由空格、缩进和换行符分割，则它们实际上是一个整体。

** 2.2.1 变量定义
   对象是指一块能存储数据并具有某种类型的内存空间。变量是用来引用该对象的名字。

   初始化和赋值是完全不同的操作。

   当内置类型变量使用 *列表初始化* 的好处：如果使用列表初始化且初始值存在丢失信息的风险，则编译器将报错。

   定义在 *块中* 的 *内置类型或复合类型的对象* 被 *默认初始化* ，否则它们的值是 *未定义* 的。

   为了支持分离式编译，C++语言将声明和定义分开。最佳实践： *只在头文件中定义变量声明*

   声明使变量为程序所知，定义创建与名字关联的实体，也就是说定义分配了内存。

   C++ 是静态类型语言，其含义是在编译阶段检查类型。

   几种初始化方式说明：
   + 默认初始化，意味着内置类型和组合类型的对象的值是未定义的，而类类型对象使用默认构造函数进行初始化。
   + 直接初始化， =int i = 10;=
   + 构造方式初始化，使用 =()=
   + 列表初始化，使用 ={}=

** 2.2.4 作用域
   C++中大多数作用域都以花括号分割。实际上只有两种作用域：
   + 全局作用域：在整个程序的范围内都可以使用。
   + 块作用域，花括号以内的部分。

** 2.3.1 引用
   *引用不是对象，只是对象的别名* ，这是引用的本质，很多引用的特性都基于此：
   + 所以必须初始化。
   + 由于所有对引用的操作都是作用于绑定的对象本身，所以无法将引用重新绑定到别的对象。
   + 因为引用不是对象，也不能定义引用的引用。
   + 引用的类型要和与之绑定的对象类型严格匹配。
   + 引用只能绑定在对象上，不能是字面值或者某个表达式的计算结果。

   为什么需要引用？[fn:2]
   1. 引用作为变量的短名字，代码更清晰。而且指针是对象，占用内存，引用只是别名，不占用内存（标准规定）。
      #+BEGIN_SRC c++
auto& nDays =  Month[monthindex].NumberOfDays;
      #+END_SRC
      如果不这样使用，可能要使用指针或赋值给新的变量，都会有内存开销。

      目前编译器实现中，引用底层使用指针实现的，但是编译器可能对此有优化，所以有时候可以不用内存空间。

   2. 引用通常用在函数参数，或者返回值。相比指针：
      1. 写法更简单。

         第二种函数调用，单从使用就知道输入参数和输出参数。而且 input 在使用过程中，还不用加 =*= 。

      2. 比指针更安全，指针可能为空，使用需要进行判断，而引用则不需要。

   引用是如何实现的？

   应用底层使用指针实现的：


   #+BEGIN_EXAMPLE
&x=8af7c48,&y=8af7c4c,&b=8af7c48,b=1
   #+END_EXAMPLE

** 2.3.2 指针
   *指针本身是对象* 。可以不初始化，可以通过赋值重新指向别的对象。

** 2.3.3 理解复合类型的声明
   变量的定义包括 *一个基本数据类型* 和 *一组声明符* 。

   声明符由一个变量名和多个修饰符（*或&）组成。默认情况下，类型修饰符从右向左依次绑定。离变量名最近的符号对变量的类型有最直接的影响。

