reading-note/c++-primer-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-10 二 19:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>《C++ Primer》读书笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">《C++ Primer》读书笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2a3bdfe">第1章 开始</a>
<ul>
<li><a href="#orgd5c33a6">1.2</a></li>
<li><a href="#org280e492">1.4.3</a></li>
</ul>
</li>
<li><a href="#org7dadd31">第2章 变量和基本类型</a>
<ul>
<li><a href="#orga5fa32b">2.1.1算数类型</a></li>
<li><a href="#orgd35ba07">2.1.2类型转换</a></li>
<li><a href="#org59415dd">2.1.3字面量常量</a></li>
<li><a href="#org5425ca0">2.2.1变量定义</a></li>
<li><a href="#org668f5f7">2.2.4 作用域</a></li>
<li><a href="#orgd8704bd">2.3.1 引用</a></li>
<li><a href="#org7cda15f">2.3.2指针</a></li>
<li><a href="#orgc571e8b">2.3.3 理解复合类型的声明</a></li>
<li><a href="#orgb4ba5b4">2.4 const限定符</a></li>
<li><a href="#org6603872">2.5.1类型别名</a></li>
<li><a href="#org7c59d74">2.5.2 auto类型说明符</a></li>
<li><a href="#orgfb7eb24">2.5.3 decltype类型指示符</a></li>
<li><a href="#org3f598a2">2.6.1自定义数据结构</a></li>
</ul>
</li>
<li><a href="#org5788e78">第3章 字符串、向量和数组</a>
<ul>
<li><a href="#org6d522ec">3.1 命名空间的using声明</a></li>
<li><a href="#org7c05227">3.2.2 string对象上的操作</a></li>
<li><a href="#org38574d5">3.3 标准库vector</a></li>
<li><a href="#org13f3dd7">3.3.2 向vector对象添加元素</a></li>
<li><a href="#orgcc8fbd8">3.4.1 使用迭代器</a></li>
</ul>
</li>
<li><a href="#org0bb47e6">第4章 表达式</a>
<ul>
<li><a href="#org2e4000e">4.8 位运算符</a></li>
<li><a href="#org34885f7">4.11.3</a></li>
</ul>
</li>
<li><a href="#org135f320">第5章 语句</a>
<ul>
<li><a href="#orgf3af97b">5.6.2 try</a></li>
</ul>
</li>
<li><a href="#org2eb628a">第6章 函数</a>
<ul>
<li><a href="#orgcc76618">6.1 函数基础</a></li>
<li><a href="#orgea22a26">6.1.2 函数声明</a></li>
<li><a href="#org8baf475">6.5.2 内联函数和constexpr函数</a></li>
</ul>
</li>
<li><a href="#org69f995b">第7章 类</a>
<ul>
<li><a href="#orgfaccfc1">7.1.1</a></li>
<li><a href="#org51ec07a">7.1.2</a></li>
<li><a href="#org915ad1d">7.1.4 构造函数</a></li>
<li><a href="#org3537076">7.3.1 类成员再探</a></li>
<li><a href="#orgda2dbc0">7.5.1 构造函数初始值列表</a></li>
<li><a href="#org7649fda">7.5.4 隐式的类类型转换</a></li>
<li><a href="#org54331b8">7.6 类的静态成员</a></li>
</ul>
</li>
<li><a href="#org918e46a">第8章 IO库</a>
<ul>
<li><a href="#orgf7133df">IO类</a>
<ul>
<li><a href="#org0211aac">IO对象无拷贝或赋值</a></li>
<li><a href="#org02de0e2">条件状态</a></li>
</ul>
</li>
<li><a href="#org832152a">文件输入输出</a></li>
<li><a href="#org50b6691">string流</a></li>
</ul>
</li>
<li><a href="#orgfaa0314">第9章 顺序容器</a>
<ul>
<li><a href="#org6cdd935">9.2.3 begin和end成员</a></li>
<li><a href="#org4095989">9.2.4 容器的定义和初始化</a></li>
<li><a href="#org98546d9">9.2.5 赋值和swap</a></li>
<li><a href="#orgcf12fa7">9.3.1向顺序容器添加元素</a></li>
<li><a href="#org6d506df">9.3.2访问元素</a></li>
<li><a href="#orge5b6188">9.3.3删除元素</a></li>
<li><a href="#org2c1cf03">9.3.4特殊的forward_list操作</a></li>
<li><a href="#org56ae6aa">9.3.6容器操作可能使迭代器失效</a></li>
<li><a href="#org662d10c">9.4 vector对象是如何增长的</a></li>
<li><a href="#org24266c0">9.6 容器适配器</a></li>
</ul>
</li>
<li><a href="#org3a0f9e3">第10章 泛型算法</a>
<ul>
<li><a href="#org54a6512">10.1概述</a></li>
<li><a href="#org35b5e2d">10.2初识泛型算法</a></li>
<li><a href="#org05a9ca8">10.3.2 lambda表达式</a></li>
<li><a href="#orgb887ac0">10.3.3 lambda捕获和返回</a></li>
<li><a href="#orgb36b931">10.3.4 参数绑定</a></li>
<li><a href="#org0429f44">10.4 再探迭代器</a></li>
<li><a href="#orge89102c">10.5泛型算法结构</a></li>
</ul>
</li>
<li><a href="#org2c792ed">第11章 关联容器</a>
<ul>
<li><a href="#org4d6c9e0">使用关联容器</a></li>
<li><a href="#org0afb820">关联容器概述</a>
<ul>
<li><a href="#orgc175751">定义关联容器</a></li>
<li><a href="#orgc8d4176">关键字类型的要求</a></li>
</ul>
</li>
<li><a href="#org282780d">关联容器操作</a>
<ul>
<li><a href="#orgd98bafc">关联容器和迭代器</a></li>
<li><a href="#orge292bbd">添加元素</a></li>
<li><a href="#org021971b">删除元素</a></li>
<li><a href="#org810011f">map的下标操作</a></li>
<li><a href="#orgeca1da6">访问元素</a></li>
</ul>
</li>
<li><a href="#orgb68d6e3">无序容器</a></li>
</ul>
</li>
<li><a href="#org7522105">第12章 动态内存</a>
<ul>
<li><a href="#org2fa67a5">12.1动态内存与智能指针</a></li>
<li><a href="#org706f6c8">12.1.2 直接管理内存</a></li>
<li><a href="#orgb481264">12.1.3 shared_ptr和new</a></li>
<li><a href="#org25b185e">12.1.5 unique_ptr</a></li>
<li><a href="#org79209db">12.1.6 weak_ptr</a></li>
<li><a href="#org37ae0a6">12.2 动态数组</a></li>
</ul>
</li>
<li><a href="#orgad65523">第13章 拷贝控制</a>
<ul>
<li><a href="#org077300b">13.3</a></li>
<li><a href="#org984ff94">13.1.1</a></li>
<li><a href="#org42ffd0a">13.1.2</a></li>
<li><a href="#org4580328">13.1.4</a></li>
<li><a href="#org5fd1981">13.2.1</a></li>
<li><a href="#org94114ed">13.6 对象移动</a></li>
<li><a href="#orgf656475">13.6.1 右值引用</a></li>
</ul>
</li>
<li><a href="#org4f4dbf9">第14章 重载运算与类型转换</a>
<ul>
<li><a href="#org9e1e632">基本概念</a></li>
<li><a href="#org48cdd36">输入和输出运算符</a></li>
<li><a href="#org39af74e">算术和关系运算符</a></li>
<li><a href="#orgf9a9941">赋值运算符</a></li>
<li><a href="#orgaf9601c">下标运算符</a></li>
<li><a href="#org4e30aae">递增和递减运算符</a></li>
<li><a href="#orgf485b7d">成员访问运算符</a></li>
<li><a href="#org521e03b">函数调用运算符</a></li>
<li><a href="#org211725b">重载、类型转换与运算符</a></li>
</ul>
</li>
<li><a href="#orgbc9ef34">第15章 面向对象程序设计</a>
<ul>
<li><a href="#org4654d70">15.1</a></li>
<li><a href="#org90b860e">15.2.1</a></li>
<li><a href="#org63389a6">15.2.2</a></li>
<li><a href="#org6129bee">15.3</a></li>
<li><a href="#orgc9a5cb4">15.4 抽象基类</a></li>
<li><a href="#orgf1f6152">15.5 访问控制和继承</a></li>
<li><a href="#org7ad6ea0">15.6 继承中的作用域</a></li>
<li><a href="#orgd5eccf8">15.7.1 虚析构函数</a></li>
<li><a href="#org5458f99">15.7.2 合成拷贝控制与继承</a></li>
<li><a href="#org09f9863">15.7.3</a></li>
<li><a href="#org5f6fdad">15.7.4 继承的构造函数</a></li>
</ul>
</li>
<li><a href="#org93d449e">第16章 模板与泛型编程</a></li>
<li><a href="#orgff15b4f">第17章 标准库特殊设施</a></li>
<li><a href="#org664a53f">第18章 用于大型程序的工具</a>
<ul>
<li><a href="#orgcdab539">异常处理</a></li>
<li><a href="#org5deac72">命名空间</a></li>
<li><a href="#orgc82d8c9">18.3.1 多重继承</a></li>
<li><a href="#org8781e73">18.3.2</a></li>
<li><a href="#orgdb89064">18.3.3 多重继承下的类作用域</a></li>
<li><a href="#org97cda69">18.3.4 虚继承</a></li>
<li><a href="#orgda8bcf6">15.3.5 构造函数与虚继承</a></li>
</ul>
</li>
<li><a href="#org441f90d">第19章 特殊工具与技术</a>
<ul>
<li><a href="#org20d28d3">控制内存分配</a>
<ul>
<li><a href="#org88ad137">定位new修改内存数据</a></li>
</ul>
</li>
<li><a href="#orga407e9d">运行时类型识别</a></li>
<li><a href="#orgbdd4e07">枚举类型</a></li>
<li><a href="#orgb4d2f01">类成员指针</a></li>
<li><a href="#orgfa5def7">嵌套类</a></li>
<li><a href="#org97b2422">union</a></li>
<li><a href="#org99bf2fa">局部类</a></li>
<li><a href="#org33a7dd2">固有的不可移植的特性</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2a3bdfe" class="outline-2">
<h2 id="org2a3bdfe">第1章 开始</h2>
<div class="outline-text-2" id="text-org2a3bdfe">
</div>
<div id="outline-container-orgd5c33a6" class="outline-3">
<h3 id="orgd5c33a6">1.2</h3>
<div class="outline-text-3" id="text-orgd5c33a6">
<p>
endl是一个被称为操纵符（manipulator）的特殊值。写入endl的效果是结束当前行，并将与设备相关的缓冲区中的内容刷新到设备中。
</p>
</div>
</div>

<div id="outline-container-org280e492" class="outline-3">
<h3 id="org280e492">1.4.3</h3>
<div class="outline-text-3" id="text-org280e492">
<p>
使用istream对象作为条件时，其效果是检测流的状态：
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #a1db00;">while</span>(<span style="color: #5fafd7;">std</span>::cin &gt;&gt; value) {

}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7dadd31" class="outline-2">
<h2 id="org7dadd31">第2章 变量和基本类型</h2>
<div class="outline-text-2" id="text-org7dadd31">
</div>
<div id="outline-container-orga5fa32b" class="outline-3">
<h3 id="orga5fa32b">2.1.1算数类型</h3>
<div class="outline-text-3" id="text-orga5fa32b">
<p>
可寻址的最小内存块称为“字节”，存储的基本单元称为“字”。
</p>

<p>
C++ 标准指定了浮点数 <b>有效位数</b> 最小值，通常float以1个字（32比特）来表示，double以2个字（64比特）表示。
</p>

<p>
为什么整数规定的存储所用的内存，而浮点数规定的有效位数呢，这是由于二者在内存中的存储方式不同导致的。<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>

<p>
与其他整型不同，字符型分为了三种：char、signed char、unsigned char。尽管字符型有三种，但是表现形式只有两种：带符号和无符号的。类型char实际上会表现为哪种有编译器确定。
</p>

<p>
执行浮点运算选择double，因为精度更高，计算代价和float差不多，有的机器甚至更快。
</p>
</div>
</div>

<div id="outline-container-orgd35ba07" class="outline-3">
<h3 id="orgd35ba07">2.1.2类型转换</h3>
<div class="outline-text-3" id="text-orgd35ba07">
<p>
自动进行类型转换。类型转换规则中需要注意的地方：
</p>
<ul class="org-ul">
<li>浮点数赋给整数，结果仅保留浮点数的整数部分。</li>
<li>赋值给无符号类型超过其表示范围时，结果是初始值对无符号类型表示数取模后的余数。</li>
<li>赋值给带符号类型超过其表示范围时，结果是未定义的。</li>
<li>带符号和无符号混用，带符号数自动转换为无符号数。 <b>不要混用带符号类型和无符号类型</b></li>
</ul>
</div>
</div>

<div id="outline-container-org59415dd" class="outline-3">
<h3 id="org59415dd">2.1.3字面量常量</h3>
<div class="outline-text-3" id="text-org59415dd">
<p>
默认情况下，十进制字面值是带符号数，八进制和十六进制字面值既可能是带符号的，也可能是无符号的。
</p>

<p>
十进制字面值的类型是int、long、long long中能容纳其值的最小者。
</p>

<p>
八进制和十六进制字面值的类型是能容纳其数值的int、unsigned int、long、unsigned long、long long、unsigned long long中的尺寸最小者。如果放不下，报错。
</p>

<p>
short没有对应的字面值。
</p>

<p>
浮点型字面值是一个double。
</p>

<p>
单引号括起来的是字符，双引号括起来的是字符串。
</p>

<p>
如果两个字符串字面值位置紧邻且仅由空格、缩进和换行符分割，则它们实际上是一个整体。
</p>
</div>
</div>

<div id="outline-container-org5425ca0" class="outline-3">
<h3 id="org5425ca0">2.2.1变量定义</h3>
<div class="outline-text-3" id="text-org5425ca0">
<p>
对象是指一块能存储数据并具有某种类型的内存空间。变量是用来引用该对象的名字。
</p>

<p>
初始化和赋值是完全不同的操作。
</p>

<p>
当内置类型变量使用 <b>列表初始化</b> 的好处：如果使用列表初始化且初始值存在丢失信息的风险，则编译器将报错。
</p>

<p>
定义在 <b>块中</b> 的 <b>内置类型或复合类型的对象</b> 被 <b>默认初始化</b> ，则它们的值是 <b>未定义</b> 的。
</p>

<p>
为了支持分离式编译，C++语言将声明和定义分开。最佳实践： <b>只在头文件中定义变量声明</b>
</p>

<p>
声明使变量为程序所知，定义创建与名字关联的实体，也就是说定义分配了内存。
</p>

<p>
C++ 是静态类型语言，其含义是在编译阶段检查类型。
</p>

<p>
几种初始化方式说明：
</p>
<ul class="org-ul">
<li>默认初始化，意味着内置类型和组合类型的对象的值是未定义的，而类类型对象使用默认构造函数进行初始化。</li>
<li>直接初始化， <code>int i = 10;</code></li>
<li>构造方式初始化，使用 <code>()</code></li>
<li>列表初始化，使用 <code>{}</code></li>
</ul>
</div>
</div>

<div id="outline-container-org668f5f7" class="outline-3">
<h3 id="org668f5f7">2.2.4 作用域</h3>
<div class="outline-text-3" id="text-org668f5f7">
<p>
C++中大多数作用域都以花括号分割。实际上只有两种作用域：
</p>
<ul class="org-ul">
<li>全局作用域：在整个程序的范围内都可以使用。</li>
<li>块作用域，花括号以内的部分。</li>
</ul>
</div>
</div>

<div id="outline-container-orgd8704bd" class="outline-3">
<h3 id="orgd8704bd">2.3.1 引用</h3>
<div class="outline-text-3" id="text-orgd8704bd">
<p>
<b>引用不是对象，只是对象的别名</b> ，这是引用的本质，很多引用的特性都基于此：
</p>
<ul class="org-ul">
<li>所以必须初始化。</li>
<li>由于所有对引用的操作都是作用于绑定的对象本身，所以无法将引用重新绑定到别的对象。</li>
<li>因为引用不是对象，也不能定义引用的引用。</li>
<li>引用的类型要和与之绑定的对象类型严格匹配。</li>
<li>引用只能绑定在对象上，不能是字面值或者某个表达式的计算结果。</li>
</ul>

<p>
为什么需要引用？<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>
</p>
<ol class="org-ol">
<li><p>
引用作为变量的短名字，代码更清晰。而且指针是对象，占用内存，引用只是别名，不占用内存（标准规定）。
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #a1db00;">auto</span>&amp; <span style="color: #ff8700;">nDays</span> =  Month[monthindex].NumberOfDays;
</pre>
</div>
<p>
如果不这样使用，可能要使用指针或赋值给新的变量，都会有内存开销。
</p>

<p>
目前编译器实现中，引用底层使用指针实现的，但是编译器可能对此有优化，所以有时候可以不用内存空间。
</p></li>

<li>引用通常用在函数参数，或者返回值。相比指针：
<ol class="org-ol">
<li><p>
写法更简单。
</p>
<div class="HTML">
<p>
&lt;script src="<a href="https://gist.github.com/phenix3443/0addf6362bf16c0d9e1d2f294e921c14.js">https://gist.github.com/phenix3443/0addf6362bf16c0d9e1d2f294e921c14.js</a>"&gt;&lt;/script&gt;
</p>

</div>

<p>
第二种函数调用，单从使用就知道输入参数和输出参数。而且input在使用过程中，还不用加 <code>*</code> 。
</p></li>

<li>比指针更安全，指针可能为空，使用需要进行判断，而引用则不需要。</li>
</ol></li>
</ol>

<p>
引用是如何实现的？
</p>

<p>
应用底层使用指针实现的：
</p>
<div class="HTML">
<p>
&lt;script src="<a href="https://gist.github.com/phenix3443/c276793402ccce06b60d991c98fd48ee.js">https://gist.github.com/phenix3443/c276793402ccce06b60d991c98fd48ee.js</a>"&gt;&lt;/script&gt;
</p>

</div>

<pre class="example">
&amp;x=8af7c48,&amp;y=8af7c4c,&amp;b=8af7c48,b=1
</pre>
</div>
</div>

<div id="outline-container-org7cda15f" class="outline-3">
<h3 id="org7cda15f">2.3.2指针</h3>
<div class="outline-text-3" id="text-org7cda15f">
<p>
<b>指针本身是对象</b> 。可以不初始化，可以通过赋值重新指向别的对象。
</p>
</div>
</div>

<div id="outline-container-orgc571e8b" class="outline-3">
<h3 id="orgc571e8b">2.3.3 理解复合类型的声明</h3>
<div class="outline-text-3" id="text-orgc571e8b">
<p>
变量的定义包括 <b>一个基本数据类型</b> 和 <b>一组声明符</b> 。
</p>

<p>
声明符由一个变量名和多个修饰符（*或&amp;）组成。默认情况下，类型修饰符从右向左依次绑定。离变量名最近的符号对变量的类型有最直接的影响。
</p>
</div>
</div>
