content/reading-note/c++-primer-notes.org
** 2.4 const 限定符
   const 对象必须初始化。

   默认情况下，const 对象仅在文件内有效。这是因为编译器在编译过程中把用到该变量的地方都替换成对应的值。所以必须在每个用到该变量的文件中都有对它的定义。为了支持这一用法，同时避免对同一变量的重复定义，默认情况下，const 对象被设定为仅在文件内有效。

   但是，有些情况下，需要在不同文件中共享同一常量，而我们不想每个文件都生成独立的变量。也就是说，希望在一个文件中定义，而在其他多个文件中声明并使用它，做法是：对于 const 变量 *不管是声明还是定义* 都使用 extern 关键字。

   为什么要在定义之前也添加 extern 关键字呢？之前不是变量定义和 extern 一起相当于 extern 无效么？其实 extern 是用来修饰 const 的，之前说过 const 变量默认值在文件中有效，加上 extern 之后，就是告诉编译器，该 const 对象也会被其他文件引用到。

   当常量引用被绑定到 *另外一种类型* 的对象上时，实际上是绑定到了另外一种类型变量转换的临时变量上。

   常量引用只是对 *引用可参与的操作* 做了限定，对引用所指的对象本身是否是常量并不做限定。

   const 修饰符可以出现的位置有那些？（变量定义，参数声明，返回值声明，const 类成员函数）
** 2.5.1 类型别名

   在使用类型别名的声明语句时，将它替换成本来的样子是一种错误的解析方法。例如：

** 2.5.2 auto 类型说明符
   编译器以引用对象的类型作为 auto 的类型。如果希望推断出的 auto 类型是引用，需要明确指出。

   auto 一般会忽略调顶层的 const。如果希望推断出的 auto 类型是顶层 const，需要明确指出。

** 2.5.3 decltype 类型指示符
   后续补充。

** 2.6.1 自定义数据结构
   C++11 新规定，可以为数据成员提供 *类内初始值* 。

* 第 3 章 字符串、向量和数组
** 3.1 命名空间的 using 声明
   头文件不应包含 using 声明。

** 3.2.2 string 对象上的操作
   stirng::size()返回的是 string::size_type 类型。

** 3.3 标准库 vector
   vector 是模板而非类型。

   vector 能容纳绝大多数类型的对象作为其元素，但是因为引用不是对象，所以不存在保存引用的 vector。

** 3.3.2 向 vector 对象添加元素
   vector 对象可以高校添加元素，没必要预先指定 vector 元素的容量。

   如果循环内部包含有向 vector 对象添加元素的语句，不要使用范围 for 语句。

** 3.4.1 使用迭代器
   所有标准库容器的迭代器都定义了 ~==~ 和 ~!=~ ，但是它们中的大多数都没有定义 =<= 运算符。所以使用尽量将迭代器与 ~!=~ 一起使用。

   但凡使用迭代器的循环体，都不要有改变 vector 对象容量的操作。

* 第 4 章 表达式
** 4.8 位运算符
   位运算符如何处理运算对象的“符号位”依赖于机器，所以强烈建议仅将位运算符用于处理无符号类型。

** 4.11.3
   任何具有明确定义的类型转换，只要不包含底层 const，都可以使用 const_cast。

   当需要把较大的算数类型赋值给较小的类型时，static_cast 很有用。

   const_cast 只能改变运算对象底层的 const。

* 第 5 章 语句
** 5.6.2 try
   编写异常安全的代码非常困难。我们必须清楚异常何时发生，异常发生后如何确保对象有效、资源无泄漏、程序处于合理状态等。

* 第 6 章 函数
** 6.1 函数基础
   编译器能以任意可行的顺序对实参求值。

** 6.1.2 函数声明
   含有函数声明的头文件应该被包含到定义函数的源文件中，编译器验证函数的声明和定义是否匹配。

** 6.5.2 内联函数和 constexpr 函数
   内联函数和 constexpr 函数可以在程序中多次定义。编译器需要展开内联函数，所以内联函数和 constexpr 函数通常定义在头文件中。

* 第 7 章 类
  类的基本思想是 *数据抽象* 和 *封装* 。数据抽象是一种依赖于 *接口* 和 *实现* 分离的编程技术。类的接口包括用户所能执行的操作；类的实现包括类的数据成员、负责接口实现的函数体已经定义类所需要的各种私有函数。（所以类的数据成员应该都是 private，对其访问应该通过 set 或者 get 函数）

** 7.1.1
   为什么执行加法和 IO 操作的函数不能是成员函数？

** 7.1.2
   定义在类内部的函数是隐式的 inline 函数。

   编译器分两步：首先编译成员声明，然后才轮到函数体。

** 7.1.4 构造函数
   构造函数不能声明成 const，当创建类的一个 const 对象时，直到构造函数完成初始化过程，对象才能真正获得其“常量”属性。因此，构造函数在 const 对象的构造过程中可以向其写值。

   编译器只有在发现类 *没有任何构造函数* 的情况下才会生成一个默认的构造函数。这条规则的依据是：如果一个类在某种情况下需要控制对象初始化，那么该类很可能在所有情况下都需要控制。

   在什么情况下编译器不会为类合成默认构造函数？
   1. 如果类已经有任何构造函数。
   2. 如果类成员没有默认构造函数，无法初始化该成员。

   含有内置类型或复合类型成员的类应该在类的内部初始化这些成员，或者定一个自己的默认构造函数。

   编译器会自动合成默认构造函数，拷贝，赋值和析构函数。

   struct 和 class 只有默认访问权限的不同。

** 7.3.1 类成员再探
   只在类的外部定义的地方说明 inline。inline 成员函数应该和相应的类定义在同一个头文件中。

   multable 表明某个数据成员是可以修改的，即使在 const 成员函数中。

** 7.5.1 构造函数初始值列表
   如果没有在构造函数的初始值列表中显示初始化成员，则该成员将在构造函数体之前执行默认初始化。

   有时我们可以忽略数据成员初始化和赋值之间的差异。但 *如果成员是 const 或者引用的话，必须将其初始化。类似的，当成员属于某种类类型且该类型没有定义默认构造函数时，也必须将该成员初始化。*

   成员初始化的顺序与它们在类定义中出现的顺序一致。

   C++11 支持委托构造函数。

** 7.5.4 隐式的类类型转换

   如果构造函数只接受一个实参，则它实际上定义了转换为此类型的隐式转换机制。

   使用 explicit 阻止隐式类型转换。只在类内声明时说明。

   explicit 声明的构造函数只能用于直接初始化，不能用于拷贝初始化。

** 7.6 类的静态成员

   静态成员函数不能声明为 const，因为它不与类对象绑定在一起。

   在类外部定义静态成员时，不能重复 static 关键字，该关键字只出现在类内部的声明语句。

   静态成员不属于类对象，所以不能在类的内部定义。必须在类的外部定义和初始化每个静态成员。 *然而* ，我们可以为静态成员提供 const 整数类型的类内初始值，不过要求静态成员必须是字面值常量类型的 constexpr。

* 第 8 章 IO 库
** IO 类
*** IO 对象无拷贝或赋值
    L279:我们不能对 IO 对象进行拷贝。读写一个 IO 对象会改变其状态，因此传递和返回的引用不能是 const。
*** 条件状态
    #+BEGIN_SRC c++ :tangle c++-primer/iostream-state.cc
#include <iostream>

int main(int argc, char *argv[])
{
	std::cout << std::cout.bad() << std::endl;

    return 0;
}

    #+END_SRC
** 文件输入输出

** string 流
* 第 9 章 顺序容器
** 9.2.3 begin 和 end 成员
   当 auto 和 begin 或 end 结合使用时，获得的迭代器类型依赖于容器类型，与我们想要如何使用迭代器毫不相干。
   #+BEGIN_SRC c++
auto it7 = a.begin(); //仅当a是const时， it7是const_iterator
auto it8 = a.cbegin(); //it8是const_iterator
   #+END_SRC
** 9.2.4 容器的定义和初始化
   array 元素会默认初始化。

   assign 不适合关联容器和 array。
** 9.2.5 赋值和 swap
   除 array 外，swap 不对任何元素进行拷贝、删除或插入操作，因此可以保证在常数时间内完成。

** 9.3.1 向顺序容器添加元素
   容器元素是拷贝。

   insert 插入到迭代器指示的位置之前，并返回指向插入的第一个元素的 *迭代器* 。为什么是前插？因为迭代器可能指向容器尾部之后不存在元素的位置，而且在容器开始位置插入元素是很有用的功能能。

