reading-note/c++-primer-notes.html

<div id="outline-container-orgb4ba5b4" class="outline-3">
<h3 id="orgb4ba5b4">2.4 const限定符</h3>
<div class="outline-text-3" id="text-orgb4ba5b4">
<p>
const对象必须初始化。
</p>

<p>
默认情况下，const对象仅在文件内有效。这是因为编译器在编译过程中把用到该变量的地方都替换成对应的值。所以必须在每个用到该变量的文件中都有对它的定义。为了支持这一用法，同时避免对同一变量的重复定义，默认情况下，const对象被设定为仅在文件内有效。
</p>

<p>
但是，有些情况下，需要在不同文件中共享同一常量，而我们不想每个文件都生成独立的变量。也就是说，希望在一个文件中定义，而在其他多个文件中声明并使用它，做法是：对于const变量 <b>不管是声明还是定义</b> 都使用extern关键字。
</p>

<p>
为什么要在定义之前也添加extern关键字呢？之前不是变量定义和extern一起相当于extern无效么？其实extern是用来修饰const的，之前说过const变量默认值在文件中有效，加上extern之后，就是告诉编译器，该const对象也会被其他文件引用到。
</p>

<p>
当常量引用被绑定到 <b>另外一种类型</b> 的对象上时，实际上是绑定到了另外一种类型变量转换的临时变量上。
</p>
<div class="HTML">
<p>
&lt;script src="<a href="https://gist.github.com/phenix3443/14b0ff09867b45e5d55b712d09a12f1f.js">https://gist.github.com/phenix3443/14b0ff09867b45e5d55b712d09a12f1f.js</a>"&gt;&lt;/script&gt;
</p>

</div>

<p>
结果：
</p>
<pre class="example">
&amp;d=0x7ffc4fc975c8 &amp;r=0x7ffc4fc975c4
</pre>
<p>
可以看到d与r的地址并不一样。
</p>

<p>
常量引用只是对 <b>引用可参与的操作</b> 做了限定，对引用所指的对象本身是否是常量并不做限定。
</p>

<p>
const修饰符可以出现的位置有那些？（变量定义，参数声明，返回值声明，const类成员函数）
</p>
</div>
</div>
<div id="outline-container-org6603872" class="outline-3">
<h3 id="org6603872">2.5.1类型别名</h3>
<div class="outline-text-3" id="text-org6603872">
<p>
在使用类型别名的声明语句时，将它替换成本来的样子是一种错误的解析方法。例如：
</p>
<div class="HTML">
<p>
&lt;script src="<a href="https://gist.github.com/phenix3443/0f703b4f7ee97049428aa0939bc08d46.js">https://gist.github.com/phenix3443/0f703b4f7ee97049428aa0939bc08d46.js</a>"&gt;&lt;/script&gt;
</p>

</div>
</div>
</div>

<div id="outline-container-org7c59d74" class="outline-3">
<h3 id="org7c59d74">2.5.2 auto类型说明符</h3>
<div class="outline-text-3" id="text-org7c59d74">
<p>
编译器以引用对象的类型作为auto的类型。如果希望推断出的auto类型是引用，需要明确指出。
</p>

<p>
auto一般会忽略调顶层的const。如果希望推断出的auto类型是顶层const，需要明确指出。
</p>
</div>
</div>

<div id="outline-container-orgfb7eb24" class="outline-3">
<h3 id="orgfb7eb24">2.5.3 decltype类型指示符</h3>
<div class="outline-text-3" id="text-orgfb7eb24">
<p>
后续补充。
</p>
</div>
</div>

<div id="outline-container-org3f598a2" class="outline-3">
<h3 id="org3f598a2">2.6.1自定义数据结构</h3>
<div class="outline-text-3" id="text-org3f598a2">
<p>
C++11新规定，可以为数据成员提供 <b>类内初始值</b> 。
</p>
</div>
</div>
</div>

<div id="outline-container-org5788e78" class="outline-2">
<h2 id="org5788e78">第3章 字符串、向量和数组</h2>
<div class="outline-text-2" id="text-org5788e78">
</div>
<div id="outline-container-org6d522ec" class="outline-3">
<h3 id="org6d522ec">3.1 命名空间的using声明</h3>
<div class="outline-text-3" id="text-org6d522ec">
<p>
头文件不应包含using声明。
</p>
</div>
</div>

<div id="outline-container-org7c05227" class="outline-3">
<h3 id="org7c05227">3.2.2 string对象上的操作</h3>
<div class="outline-text-3" id="text-org7c05227">
<p>
stirng::size()返回的是string::size_type类型。
</p>
</div>
</div>

<div id="outline-container-org38574d5" class="outline-3">
<h3 id="org38574d5">3.3 标准库vector</h3>
<div class="outline-text-3" id="text-org38574d5">
<p>
vector是模板而非类型。
</p>

<p>
vector能容纳绝大多数类型的对象作为其元素，但是因为引用不是对象，所以不存在保存引用的vector。
</p>
</div>
</div>

<div id="outline-container-org13f3dd7" class="outline-3">
<h3 id="org13f3dd7">3.3.2 向vector对象添加元素</h3>
<div class="outline-text-3" id="text-org13f3dd7">
<p>
vector对象可以高校添加元素，没必要预先指定vector元素的容量。
</p>

<p>
如果循环内部包含有向vector对象添加元素的语句，不要使用范围for语句。
</p>
</div>
</div>

<div id="outline-container-orgcc8fbd8" class="outline-3">
<h3 id="orgcc8fbd8">3.4.1 使用迭代器</h3>
<div class="outline-text-3" id="text-orgcc8fbd8">
<p>
所有标准库容器的迭代器都定义了 <code>==</code> 和 <code>!=</code> ，但是它们中的大多数都没有定义 <code>&lt;</code> 运算符。所以使用尽量将迭代器与 <code>!=</code> 一起使用。
</p>

<p>
但凡使用迭代器的循环体，都不要有改变vector对象容量的操作。
</p>
</div>
</div>
</div>

<div id="outline-container-org0bb47e6" class="outline-2">
<h2 id="org0bb47e6">第4章 表达式</h2>
<div class="outline-text-2" id="text-org0bb47e6">
</div>
<div id="outline-container-org2e4000e" class="outline-3">
<h3 id="org2e4000e">4.8 位运算符</h3>
<div class="outline-text-3" id="text-org2e4000e">
<p>
位运算符如何处理运算对象的“符号位”依赖于机器，所以强烈建议仅将位运算符用于处理无符号类型。
</p>
</div>
</div>

<div id="outline-container-org34885f7" class="outline-3">
<h3 id="org34885f7">4.11.3</h3>
<div class="outline-text-3" id="text-org34885f7">
<p>
任何具有明确定义的类型转换，只要不包含底层const，都可以使用const_cast。
</p>

<p>
当需要把较大的算数类型赋值给较小的类型时，static_cast很有用。
</p>

<p>
const_cast只能改变运算对象底层的const。
</p>
</div>
</div>
</div>

<div id="outline-container-org135f320" class="outline-2">
<h2 id="org135f320">第5章 语句</h2>
<div class="outline-text-2" id="text-org135f320">
</div>
<div id="outline-container-orgf3af97b" class="outline-3">
<h3 id="orgf3af97b">5.6.2 try</h3>
<div class="outline-text-3" id="text-orgf3af97b">
<p>
编写异常安全的代码非常困难。我们必须清楚异常何时发生，异常发生后如何确保对象有效、资源无泄漏、程序处于合理状态等。
</p>
</div>
</div>
</div>

<div id="outline-container-org2eb628a" class="outline-2">
<h2 id="org2eb628a">第6章 函数</h2>
<div class="outline-text-2" id="text-org2eb628a">
</div>
<div id="outline-container-orgcc76618" class="outline-3">
<h3 id="orgcc76618">6.1 函数基础</h3>
<div class="outline-text-3" id="text-orgcc76618">
<p>
编译器能以任意可行的顺序对实参求值。
</p>
</div>
</div>

<div id="outline-container-orgea22a26" class="outline-3">
<h3 id="orgea22a26">6.1.2 函数声明</h3>
<div class="outline-text-3" id="text-orgea22a26">
<p>
含有函数声明的头文件应该被包含到定义函数的源文件中，编译器验证函数的声明和定义是否匹配。
</p>
</div>
</div>

<div id="outline-container-org8baf475" class="outline-3">
<h3 id="org8baf475">6.5.2 内联函数和constexpr函数</h3>
<div class="outline-text-3" id="text-org8baf475">
<p>
内联函数和constexpr函数可以在程序中多次定义。编译器需要展开内联函数，所以内联函数和constexpr函数通常定义在头文件中。
</p>
</div>
</div>
</div>

<div id="outline-container-org69f995b" class="outline-2">
<h2 id="org69f995b">第7章 类</h2>
<div class="outline-text-2" id="text-org69f995b">
<p>
类的基本思想是 <b>数据抽象</b> 和 <b>封装</b> 。数据抽象是一种依赖于 <b>接口</b> 和 <b>实现</b> 分离的编程技术。类的接口包括用户所能执行的操作；类的实现包括类的数据成员、负责接口实现的函数体已经定义类所需要的各种私有函数。（所以类的数据成员应该都是private，对其访问应该通过set或者get函数）
</p>
</div>

<div id="outline-container-orgfaccfc1" class="outline-3">
<h3 id="orgfaccfc1">7.1.1</h3>
<div class="outline-text-3" id="text-orgfaccfc1">
<p>
为什么执行加法和IO操作的函数不能是成员函数？
</p>
</div>
</div>

<div id="outline-container-org51ec07a" class="outline-3">
<h3 id="org51ec07a">7.1.2</h3>
<div class="outline-text-3" id="text-org51ec07a">
<p>
定义在类内部的函数是隐式的inline函数。
</p>

<p>
编译器分两步：首先编译成员声明，然后才轮到函数体。
</p>
</div>
</div>

<div id="outline-container-org915ad1d" class="outline-3">
<h3 id="org915ad1d">7.1.4 构造函数</h3>
<div class="outline-text-3" id="text-org915ad1d">
<p>
构造函数不能声明成const，当创建类的一个const对象时，直到构造函数完成初始化过程，对象才能真正获得其“常量”属性。因此，构造函数在const对象的构造过程中可以向其写值。
</p>

<p>
编译器只有在发现类 <b>没有任何构造函数</b> 的情况下才会生成一个默认的构造函数。这条规则的依据是：如果一个类在某种情况下需要控制对象初始化，那么该类很可能在所有情况下都需要控制。
</p>

<p>
在什么情况下编译器不会为类合成默认构造函数？
</p>
<ol class="org-ol">
<li>如果类已经有任何构造函数。</li>
<li>如果类成员没有默认构造函数，无法初始化该成员。</li>
</ol>

<p>
含有内置类型或复合类型成员的类应该在类的内部初始化这些成员，或者定一个自己的默认构造函数。
</p>

<p>
编译器会自动合成默认构造函数，拷贝，赋值和析构函数。
</p>

<p>
struct和class只有默认访问权限的不同。
</p>
</div>
</div>

<div id="outline-container-org3537076" class="outline-3">
<h3 id="org3537076">7.3.1 类成员再探</h3>
<div class="outline-text-3" id="text-org3537076">
<p>
只在类的外部定义的地方说明inline。inline成员函数应该和相应的类定义在同一个头文件中。
</p>

<p>
multable表明某个数据成员是可以修改的，即使在const成员函数中。
</p>
</div>
</div>

<div id="outline-container-orgda2dbc0" class="outline-3">
<h3 id="orgda2dbc0">7.5.1 构造函数初始值列表</h3>
<div class="outline-text-3" id="text-orgda2dbc0">
<p>
如果没有在构造函数的初始值列表中显示初始化成员，则该成员将在构造函数体之前执行默认初始化。
</p>

<p>
有时我们可以忽略数据成员初始化和赋值之间的差异。但 <b>如果成员是const或者引用的话，必须将其初始化。类似的，当成员属于某种类类型且该类型没有定义默认构造函数时，也必须将该成员初始化。</b>
</p>

<p>
成员初始化的顺序与它们在类定义中出现的顺序一致。
</p>

<p>
C++11支持委托构造函数。
</p>
</div>
</div>

<div id="outline-container-org7649fda" class="outline-3">
<h3 id="org7649fda">7.5.4 隐式的类类型转换</h3>
<div class="outline-text-3" id="text-org7649fda">
<p>
如果构造函数只接受一个实参，则它实际上定义了转换为此类型的隐式转换机制。
</p>

<p>
使用explicit阻止隐式类型转换。只在类内声明时说明。
</p>

<p>
explicit声明的构造函数只能用于直接初始化，不能用于拷贝初始化。
</p>
</div>
</div>

<div id="outline-container-org54331b8" class="outline-3">
<h3 id="org54331b8">7.6 类的静态成员</h3>
<div class="outline-text-3" id="text-org54331b8">
<p>
静态成员函数不能声明为const，因为它不与类对象绑定在一起。
</p>

<p>
在类外部定义静态成员时，不能重复static关键字，该关键字只出现在类内部的声明语句。
</p>

<p>
静态成员不属于类对象，所以不能在类的内部定义。必须在类的外部定义和初始化每个静态成员。 <b>然而</b> ，我们可以为静态成员提供const整数类型的类内初始值，不过要求静态成员必须是字面值常量类型的constexpr。
</p>
</div>
</div>
</div>

<div id="outline-container-org918e46a" class="outline-2">
<h2 id="org918e46a">第8章 IO库</h2>
<div class="outline-text-2" id="text-org918e46a">
</div>
<div id="outline-container-orgf7133df" class="outline-3">
<h3 id="orgf7133df">IO类</h3>
<div class="outline-text-3" id="text-orgf7133df">
</div>
<div id="outline-container-org0211aac" class="outline-4">
<h4 id="org0211aac">IO对象无拷贝或赋值</h4>
<div class="outline-text-4" id="text-org0211aac">
<p>
L279:我们不能对IO对象进行拷贝。读写一个IO对象会改变其状态，因此传递和返回的引用不能是const。
</p>
</div>
</div>
<div id="outline-container-org02de0e2" class="outline-4">
<h4 id="org02de0e2">条件状态</h4>
<div class="outline-text-4" id="text-org02de0e2">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #d18aff;">#include</span> <span style="color: #ff4ea3;">&lt;iostream&gt;</span>

<span style="color: #00d7af;">int</span> <span style="color: #ffd700;">main</span>(<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">argc</span>, <span style="color: #00d7af;">char</span> *<span style="color: #ff8700;">argv</span>[])
{
    <span style="color: #5fafd7;">std</span>::cout &lt;&lt; <span style="color: #5fafd7;">std</span>::cout.bad() &lt;&lt; <span style="color: #5fafd7;">std</span>::endl;

    <span style="color: #a1db00;">return</span> 0;
}

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org832152a" class="outline-3">
<h3 id="org832152a">文件输入输出</h3>
<div class="outline-text-3" id="text-org832152a">
<div class="HTML">
<p>
&lt;script src="<a href="https://gist.github.com/phenix3443/c387983efa9ce2bc85040702786a865e.js">https://gist.github.com/phenix3443/c387983efa9ce2bc85040702786a865e.js</a>"&gt;&lt;/script&gt;
</p>

</div>
</div>
</div>
<div id="outline-container-org50b6691" class="outline-3">
<h3 id="org50b6691">string流</h3>
</div>
</div>
<div id="outline-container-orgfaa0314" class="outline-2">
<h2 id="orgfaa0314">第9章 顺序容器</h2>
<div class="outline-text-2" id="text-orgfaa0314">
</div>
<div id="outline-container-org6cdd935" class="outline-3">
<h3 id="org6cdd935">9.2.3 begin和end成员</h3>
<div class="outline-text-3" id="text-org6cdd935">
<p>
当auto和begin或end结合使用时，获得的迭代器类型依赖于容器类型，与我们想要如何使用迭代器毫不相干。
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #a1db00;">auto</span> <span style="color: #ff8700;">it7</span> = a.begin(); <span style="color: #6c6c6c; font-style: italic;">//</span><span style="color: #6c6c6c; font-style: italic;">&#20165;&#24403;a&#26159;const&#26102;&#65292; it7&#26159;const_iterator</span>
<span style="color: #a1db00;">auto</span> <span style="color: #ff8700;">it8</span> = a.cbegin(); <span style="color: #6c6c6c; font-style: italic;">//</span><span style="color: #6c6c6c; font-style: italic;">it8&#26159;const_iterator</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4095989" class="outline-3">
<h3 id="org4095989">9.2.4 容器的定义和初始化</h3>
<div class="outline-text-3" id="text-org4095989">
<p>
array元素会默认初始化。
</p>

<p>
assign不适合关联容器和array。
</p>
</div>
</div>
<div id="outline-container-org98546d9" class="outline-3">
<h3 id="org98546d9">9.2.5 赋值和swap</h3>
<div class="outline-text-3" id="text-org98546d9">
<p>
除array外，swap不对任何元素进行拷贝、删除或插入操作，因此可以保证在常数时间内完成。
</p>
</div>
</div>

<div id="outline-container-orgcf12fa7" class="outline-3">
<h3 id="orgcf12fa7">9.3.1向顺序容器添加元素</h3>
<div class="outline-text-3" id="text-orgcf12fa7">
<p>
容器元素是拷贝。
</p>

<p>
insert插入到迭代器指示的位置之前，并返回指向插入的第一个元素的 <b>迭代器</b> 。为什么是前插？因为迭代器可能指向容器尾部之后不存在元素的位置，而且在容器开始位置插入元素是很有用的功能能。
</p>
</div>
</div>
