content/reading-note/c++-primer-notes.org
** 9.3.2 访问元素
   访问成员函数（front、back、at、[]）返回的是 *引用* 。在调用 front 和 back 之前，要保证容器非空。

** 9.3.3 删除元素
   erase（p）删除 p 所指定的元素，返回一个指向被删除元素之后元素的迭代器。

** 9.3.4 特殊的 forward_list 操作
   forward_list 添加删除元素，添加或删除的元素之前的那个元素的后继会发生变化。但是 forward_list 没办法获取一个元素的前驱。处于这个原因，在一个 forward_list 中添加和删除元素的操作是通过改变给定元素之后的元素来完成。

   所以 forward_list 没有 insert，erase 和 emplace，而是定义了 insert_after、erase_after、emplace_after。

   注意：insert_after 返回指向最后一个插入元素的迭代器。erase_after 返回一个指向被删除元素之后元素的迭代器。

   它还定义了 before_begin 的操作。

** 9.3.6 容器操作可能使迭代器失效

   对于 vector 和 string，删除元素时，尾后爹地阿奇总是会失效。

** 9.4 vector 对象是如何增长的
   调用 reserve 永远不会减少容器占用的内存空间。类似的，resize 成员函数改变容器中元素的数目，而不是容器的容量。

** 9.6 容器适配器

   默认情况下，stack 和 queue 是基于 deque 实现的，priority_queue 是基于 vector 实现的。

* 第 10 章 泛型算法
** 10.1 概述
   算法永远不会执行容器的操作，也就是说算法不会改变底层容器的大小。
** 10.2 初识泛型算法
   理解算法的最基本的方法就是了解它们是否读取元素、改变元素或是重排元素。
** 10.3.2 lambda 表达式
   lambda 表达式具有如下形式：
   #+BEGIN_SRC c++
[capture list] (parameter list) -> return type {function body}
   #+END_SRC

** 10.3.3 lambda 捕获和返回
   当定一个一个 lambda 时，编译器生成一个与 lambda 对应的新的（未命名的）类类型。

   值捕获：被捕获的变量的值是在 lambda 创建时拷贝，而不是调用时拷贝。

   引用捕获：

   隐式捕获：

** 10.3.4 参数绑定
   待添加
** 10.4 再探迭代器
   待添加
** 10.5 泛型算法结构
   待添加

* 第 11 章 关联容器
** 使用关联容器
** 关联容器概述
   L376:关联容器不支持顺序容器的位置相关的操作，因为关联容器是根据关键字存储的。
*** 定义关联容器
*** 关键字类型的要求
    L378:有序容器关键字类型必须定义元素比较方法。
    #+BEGIN_SRC c++
multiset<key,decltype(compare)*> s; //注意不要忘记*指定函数指针
    #+END_SRC
** 关联容器操作
*** 关联容器和迭代器
    L383：我们通过不对关联容器使用泛型算法。关键是 const 这一特性意味着不能将关联容器传递给修改或重排容器元素的算法。

    L383:对关联容器使用泛型搜索算法（快排）是一个坏主意，应该使用关联容器的 find 成员函数。

    L383：在实际编程中，如果真要对一个关联容器使用算法，它经常作为一个源序列或者目的位置。copy 算法。
*** 添加元素
    L384：对于不包含重复关键字的容器，insert 函数返回的是一个 pair，first 是一个指向给定关键字元素的迭代器，second 成员是 bool，表明插入成功还是已在容器中。
*** 删除元素
    #+BEGIN_SRC c++
c.erase(k) //返回删除元素的数量
c.erase(p) c.erase(b,e) //删除指定（范围）元素，返回最后一个指向最后一个被删除元素之后位置的迭代器
    #+END_SRC
*** map 的下标操作
    L387:与其他下标运算符不同的是，如果关键字并不在 map 中，会为它创建一个元素并插入到 map 中。 *但是 at 函数不会执行插入操作，而是抛出 out_of_range*的异常。
    注意 map 下标操作符返回 ~mapped_type~ ，迭代器解引用返回 ~value_type~ 。
*** 访问元素
    #+BEGIN_SRC c++
c.find(k)
c.cout(k)
c.lower_bound(k)
c.upper_bound(k)
c.equal_range(k)
    #+END_SRC
** 无序容器
   #+CAPTION: 使用无序容器统计出现次数最多的K个数。
   #+BEGIN_SRC c++

   #+END_SRC

   #+CAPTION:求两个字符串数组的交集
   #+BEGIN_SRC c++

   #+END_SRC
   L395:无序容器的性能依赖与哈希函数的质量和桶的数量和大小。
* 第 12 章 动态内存
** 12.1 动态内存与智能指针
   shared_ptr 允许多个指针指向同一个对象。

   unique_ptr 独占所指向对象。

   weak_ptr 是一种弱引用，指向 shared_ptr 所管理的对象。

   最安全的分配和使用动态内存的方法是调用一个名为 make_shared 的标准函数。如果不传递任何参数，就进行值初始化。

   shared_ptr 在无用之后仍然保留的一种可能情况是：讲 shared_ptr 存放在一个容器中，随后重排了容器，从而不需要某些元素。在这种情况下，应该确保使用 erase 删除那些不再需要的 shared_ptr 元素。

   使用动态内存处于三种原因：
   + 程序不知道自己需要多少对象。（如容器类）
   + 程序不知道所需对象的类型。
   + 程序需要在多个对象间共享数据。

   智能指针是否可以完全替代 new 和 delete？

** 12.1.2 直接管理内存
   如果 new 不能分配所要求的内存空间，它会抛出一个类型胃 bad_alloc 的异常，使用以定位 new 阻止抛出异常：
   #+BEGIN_SRC c++
auto ptr = new (nothrow) int; // 付过分配失败，返回空指针。
   #+END_SRC

   定位 new 允许向 new 传递额外的参数。
** 12.1.3 shared_ptr 和 new
   内置指针必须通过直接初始化才能转换成智能指针，不能通过隐式转换进行。而且内置指针必须指向动态内存。

   不要混用普通指针和智能指针。
** 12.1.5 unique_ptr
   unique_ptr 不能拷贝，但是可以拷贝货值一个将要被销毁的 uniqe_ptr，所以 unique_ptr 可以作为参数或返回值传递。
** 12.1.6 weak_ptr

** 12.2 动态数组

* 第 13 章 拷贝控制
  如果一个类没有定义相应的拷贝控制成员，编译器会自动为它们定义相应的操作：拷贝构造函数，拷贝赋值操作符，移动构造函数，移动赋值操作符，析构函数。
** 13.3
   如果一个类的第一个参数是自身类型的 *引用* ，且任何额外参数都有默认值，则此构造函数是拷贝构造函数。
** 13.1.1
   拷贝构造函数发生在：
   + 使用 = 定义变量时。
   + 将一个对象作为实参传递给一个非引用类型的形参。
   + 从一个返回类型为非引用的函数返回一个对象。
   + 用花括号列表初始化一个数组中的元素或一个聚合类中的成员。
** 13.1.2
   标准库通常要求保存在容器中的类型要具有赋值运算符，且返回值是左侧运算对象的引用。

   在一个析构函数中，首先执行函数体，然后销毁成员，成员按照初始化顺序的逆序销毁。

** 13.1.4
   程序的拷贝控制函数（拷贝构造，拷贝赋值，移动构造，移动赋值，析构函数）应该看作一个整体：只要需要定义其中一个，其他函数也需要定义。

** 13.2.1
   赋值运算符通常组合了析构函数和构造函数的操作，应该是异常安全的。同时还要考虑到自赋值的情况。

** 13.6 对象移动
   对象移动的用处：
   + 节省拷贝导致的内存消耗。
   + 有些类不能拷贝，但是可以移动。例如 IO 类或者 unique_ptr;


