reading-note/c++-primer-notes.html

<div id="outline-container-org6d506df" class="outline-3">
<h3 id="org6d506df">9.3.2访问元素</h3>
<div class="outline-text-3" id="text-org6d506df">
<p>
访问成员函数（front、back、at、[]）返回的是 <b>引用</b> 。在调用front和back之前，要保证容器非空。
</p>
</div>
</div>

<div id="outline-container-orge5b6188" class="outline-3">
<h3 id="orge5b6188">9.3.3删除元素</h3>
<div class="outline-text-3" id="text-orge5b6188">
<p>
erase（p）删除p所指定的元素，返回一个指向被删除元素之后元素的迭代器。
</p>
</div>
</div>

<div id="outline-container-org2c1cf03" class="outline-3">
<h3 id="org2c1cf03">9.3.4特殊的forward_list操作</h3>
<div class="outline-text-3" id="text-org2c1cf03">
<p>
forward_list添加删除元素，添加或删除的元素之前的那个元素的后继会发生变化。但是forward_list没办法获取一个元素的前驱。处于这个原因，在一个forward_list中添加和删除元素的操作是通过改变给定元素之后的元素来完成。
</p>

<p>
所以forward_list没有insert，erase和emplace，而是定义了insert_after、erase_after、emplace_after。
</p>

<p>
注意：insert_after返回指向最后一个插入元素的迭代器。erase_after返回一个指向被删除元素之后元素的迭代器。
</p>

<p>
它还定义了before_begin的操作。
</p>
</div>
</div>

<div id="outline-container-org56ae6aa" class="outline-3">
<h3 id="org56ae6aa">9.3.6容器操作可能使迭代器失效</h3>
<div class="outline-text-3" id="text-org56ae6aa">
<p>
对于vector和string，删除元素时，尾后爹地阿奇总是会失效。
</p>
</div>
</div>

<div id="outline-container-org662d10c" class="outline-3">
<h3 id="org662d10c">9.4 vector对象是如何增长的</h3>
<div class="outline-text-3" id="text-org662d10c">
<p>
调用reserve永远不会减少容器占用的内存空间。类似的，resize成员函数改变容器中元素的数目，而不是容器的容量。
</p>
</div>
</div>

<div id="outline-container-org24266c0" class="outline-3">
<h3 id="org24266c0">9.6 容器适配器</h3>
<div class="outline-text-3" id="text-org24266c0">
<p>
默认情况下，stack和queue是基于deque实现的，priority_queue是基于vector实现的。
</p>
</div>
</div>
</div>

<div id="outline-container-org3a0f9e3" class="outline-2">
<h2 id="org3a0f9e3">第10章 泛型算法</h2>
<div class="outline-text-2" id="text-org3a0f9e3">
</div>
<div id="outline-container-org54a6512" class="outline-3">
<h3 id="org54a6512">10.1概述</h3>
<div class="outline-text-3" id="text-org54a6512">
<p>
算法永远不会执行容器的操作，也就是说算法不会改变底层容器的大小。
</p>
</div>
</div>
<div id="outline-container-org35b5e2d" class="outline-3">
<h3 id="org35b5e2d">10.2初识泛型算法</h3>
<div class="outline-text-3" id="text-org35b5e2d">
<p>
理解算法的最基本的方法就是了解它们是否读取元素、改变元素或是重排元素。
</p>
</div>
</div>
<div id="outline-container-org05a9ca8" class="outline-3">
<h3 id="org05a9ca8">10.3.2 lambda表达式</h3>
<div class="outline-text-3" id="text-org05a9ca8">
<p>
lambda表达式具有如下形式：
</p>
<div class="org-src-container">
<pre class="src src-c++">[<span style="color: #5fafd7;">capture</span> list] (<span style="color: #00d7af;">parameter</span> <span style="color: #ff8700;">list</span>) -&gt; <span style="color: #a1db00;">return</span> type {<span style="color: #00d7af;">function</span> <span style="color: #ff8700;">body</span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb887ac0" class="outline-3">
<h3 id="orgb887ac0">10.3.3 lambda捕获和返回</h3>
<div class="outline-text-3" id="text-orgb887ac0">
<p>
当定一个一个lambda时，编译器生成一个与lambda对应的新的（未命名的）类类型。
</p>

<p>
值捕获：被捕获的变量的值是在lambda创建时拷贝，而不是调用时拷贝。
</p>

<p>
引用捕获：
</p>

<p>
隐式捕获：
</p>
</div>
</div>

<div id="outline-container-orgb36b931" class="outline-3">
<h3 id="orgb36b931">10.3.4 参数绑定</h3>
<div class="outline-text-3" id="text-orgb36b931">
<p>
待添加
</p>
</div>
</div>
<div id="outline-container-org0429f44" class="outline-3">
<h3 id="org0429f44">10.4 再探迭代器</h3>
<div class="outline-text-3" id="text-org0429f44">
<p>
待添加
</p>
</div>
</div>
<div id="outline-container-orge89102c" class="outline-3">
<h3 id="orge89102c">10.5泛型算法结构</h3>
<div class="outline-text-3" id="text-orge89102c">
<p>
待添加
</p>
</div>
</div>
</div>

<div id="outline-container-org2c792ed" class="outline-2">
<h2 id="org2c792ed">第11章 关联容器</h2>
<div class="outline-text-2" id="text-org2c792ed">
</div>
<div id="outline-container-org4d6c9e0" class="outline-3">
<h3 id="org4d6c9e0">使用关联容器</h3>
</div>
<div id="outline-container-org0afb820" class="outline-3">
<h3 id="org0afb820">关联容器概述</h3>
<div class="outline-text-3" id="text-org0afb820">
<p>
L376:关联容器不支持顺序容器的位置相关的操作，因为关联容器是根据关键字存储的。
</p>
</div>
<div id="outline-container-orgc175751" class="outline-4">
<h4 id="orgc175751">定义关联容器</h4>
</div>
<div id="outline-container-orgc8d4176" class="outline-4">
<h4 id="orgc8d4176">关键字类型的要求</h4>
<div class="outline-text-4" id="text-orgc8d4176">
<p>
L378:有序容器关键字类型必须定义元素比较方法。
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #00d7af;">multiset</span>&lt;key,<span style="color: #a1db00;">decltype</span>(compare)*&gt; <span style="color: #ff8700;">s</span>; <span style="color: #6c6c6c; font-style: italic;">//</span><span style="color: #6c6c6c; font-style: italic;">&#27880;&#24847;&#19981;&#35201;&#24536;&#35760;*&#25351;&#23450;&#20989;&#25968;&#25351;&#38024;</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org282780d" class="outline-3">
<h3 id="org282780d">关联容器操作</h3>
<div class="outline-text-3" id="text-org282780d">
</div>
<div id="outline-container-orgd98bafc" class="outline-4">
<h4 id="orgd98bafc">关联容器和迭代器</h4>
<div class="outline-text-4" id="text-orgd98bafc">
<p>
L383：我们通过不对关联容器使用泛型算法。关键是const这一特性意味着不能将关联容器传递给修改或重排容器元素的算法。
</p>

<p>
L383:对关联容器使用泛型搜索算法（快排）是一个坏主意，应该使用关联容器的find成员函数。
</p>

<p>
L383：在实际编程中，如果真要对一个关联容器使用算法，它经常作为一个源序列或者目的位置。copy算法。
</p>
</div>
</div>
<div id="outline-container-orge292bbd" class="outline-4">
<h4 id="orge292bbd">添加元素</h4>
<div class="outline-text-4" id="text-orge292bbd">
<p>
L384：对于不包含重复关键字的容器，insert函数返回的是一个pair，first是一个指向给定关键字元素的迭代器，second成员是bool，表明插入成功还是已在容器中。
</p>
</div>
</div>
<div id="outline-container-org021971b" class="outline-4">
<h4 id="org021971b">删除元素</h4>
<div class="outline-text-4" id="text-org021971b">
<div class="org-src-container">
<pre class="src src-c++">c.erase(k) <span style="color: #6c6c6c; font-style: italic;">//</span><span style="color: #6c6c6c; font-style: italic;">&#36820;&#22238;&#21024;&#38500;&#20803;&#32032;&#30340;&#25968;&#37327;</span>
c.erase(p) c.erase(b,e) <span style="color: #6c6c6c; font-style: italic;">//</span><span style="color: #6c6c6c; font-style: italic;">&#21024;&#38500;&#25351;&#23450;&#65288;&#33539;&#22260;&#65289;&#20803;&#32032;&#65292;&#36820;&#22238;&#26368;&#21518;&#19968;&#20010;&#25351;&#21521;&#26368;&#21518;&#19968;&#20010;&#34987;&#21024;&#38500;&#20803;&#32032;&#20043;&#21518;&#20301;&#32622;&#30340;&#36845;&#20195;&#22120;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org810011f" class="outline-4">
<h4 id="org810011f">map的下标操作</h4>
<div class="outline-text-4" id="text-org810011f">
<p>
L387:与其他下标运算符不同的是，如果关键字并不在map中，会为它创建一个元素并插入到map中。 *但是at函数不会执行插入操作，而是抛出out_of_range*的异常。
注意map下标操作符返回 <code>mapped_type</code> ，迭代器解引用返回 <code>value_type</code> 。
</p>
</div>
</div>
<div id="outline-container-orgeca1da6" class="outline-4">
<h4 id="orgeca1da6">访问元素</h4>
<div class="outline-text-4" id="text-orgeca1da6">
<div class="org-src-container">
<pre class="src src-c++">c.find(k)
c.cout(k)
c.lower_bound(k)
c.upper_bound(k)
c.equal_range(k)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb68d6e3" class="outline-3">
<h3 id="orgb68d6e3">无序容器</h3>
<div class="outline-text-3" id="text-orgb68d6e3">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>使用无序容器统计出现次数最多的K个数。</label><pre class="src src-c++">
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>求两个字符串数组的交集</label><pre class="src src-c++">
</pre>
</div>
<p>
L395:无序容器的性能依赖与哈希函数的质量和桶的数量和大小。
</p>
</div>
</div>
</div>
<div id="outline-container-org7522105" class="outline-2">
<h2 id="org7522105">第12章 动态内存</h2>
<div class="outline-text-2" id="text-org7522105">
</div>
<div id="outline-container-org2fa67a5" class="outline-3">
<h3 id="org2fa67a5">12.1动态内存与智能指针</h3>
<div class="outline-text-3" id="text-org2fa67a5">
<p>
shared_ptr允许多个指针指向同一个对象。
</p>

<p>
unique_ptr独占所指向对象。
</p>

<p>
weak_ptr是一种弱引用，指向shared_ptr所管理的对象。
</p>

<p>
最安全的分配和使用动态内存的方法是调用一个名为make_shared的标准函数。如果不传递任何参数，就进行值初始化。
</p>

<p>
shared_ptr在无用之后仍然保留的一种可能情况是：讲shared_ptr存放在一个容器中，随后重排了容器，从而不需要某些元素。在这种情况下，应该确保使用erase删除那些不再需要的shared_ptr元素。
</p>

<p>
使用动态内存处于三种原因：
</p>
<ul class="org-ul">
<li>程序不知道自己需要多少对象。（如容器类）</li>
<li>程序不知道所需对象的类型。</li>
<li>程序需要在多个对象间共享数据。</li>
</ul>

<p>
智能指针是否可以完全替代new和delete？
</p>
<div class="HTML">
<p>
&lt;script src="<a href="https://gist.github.com/phenix3443/5cb5578751022cc7718e8bb1d724746a.js">https://gist.github.com/phenix3443/5cb5578751022cc7718e8bb1d724746a.js</a>"&gt;&lt;/script&gt;
</p>

</div>
</div>
</div>
<div id="outline-container-org706f6c8" class="outline-3">
<h3 id="org706f6c8">12.1.2 直接管理内存</h3>
<div class="outline-text-3" id="text-org706f6c8">
<p>
如果new不能分配所要求的内存空间，它会抛出一个类型胃bad_alloc的异常，使用以定位new阻止抛出异常：
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #a1db00;">auto</span> <span style="color: #ff8700;">ptr</span> = <span style="color: #a1db00;">new</span> (nothrow) <span style="color: #00d7af;">int</span>; <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">&#20184;&#36807;&#20998;&#37197;&#22833;&#36133;&#65292;&#36820;&#22238;&#31354;&#25351;&#38024;&#12290;</span>
</pre>
</div>

<p>
定位new允许向new传递额外的参数。
</p>
</div>
</div>
<div id="outline-container-orgb481264" class="outline-3">
<h3 id="orgb481264">12.1.3 shared_ptr和new</h3>
<div class="outline-text-3" id="text-orgb481264">
<p>
内置指针必须通过直接初始化才能转换成智能指针，不能通过隐式转换进行。而且内置指针必须指向动态内存。
</p>

<p>
不要混用普通指针和智能指针。
</p>
</div>
</div>
<div id="outline-container-org25b185e" class="outline-3">
<h3 id="org25b185e">12.1.5 unique_ptr</h3>
<div class="outline-text-3" id="text-org25b185e">
<p>
unique_ptr不能拷贝，但是可以拷贝货值一个将要被销毁的uniqe_ptr，所以unique_ptr可以作为参数或返回值传递。
</p>
</div>
</div>
<div id="outline-container-org79209db" class="outline-3">
<h3 id="org79209db">12.1.6 weak_ptr</h3>
</div>

<div id="outline-container-org37ae0a6" class="outline-3">
<h3 id="org37ae0a6">12.2 动态数组</h3>
</div>
</div>

<div id="outline-container-orgad65523" class="outline-2">
<h2 id="orgad65523">第13章 拷贝控制</h2>
<div class="outline-text-2" id="text-orgad65523">
<p>
如果一个类没有定义相应的拷贝控制成员，编译器会自动为它们定义相应的操作：拷贝构造函数，拷贝赋值操作符，移动构造函数，移动赋值操作符，析构函数。
</p>
</div>
<div id="outline-container-org077300b" class="outline-3">
<h3 id="org077300b">13.3</h3>
<div class="outline-text-3" id="text-org077300b">
<p>
如果一个类的第一个参数是自身类型的 <b>引用</b> ，且任何额外参数都有默认值，则此构造函数是拷贝构造函数。
</p>
</div>
</div>
<div id="outline-container-org984ff94" class="outline-3">
<h3 id="org984ff94">13.1.1</h3>
<div class="outline-text-3" id="text-org984ff94">
<p>
拷贝构造函数发生在：
</p>
<ul class="org-ul">
<li>使用 = 定义变量时。</li>
<li>将一个对象作为实参传递给一个非引用类型的形参。</li>
<li>从一个返回类型为非引用的函数返回一个对象。</li>
<li>用花括号列表初始化一个数组中的元素或一个聚合类中的成员。</li>
</ul>
</div>
</div>
<div id="outline-container-org42ffd0a" class="outline-3">
<h3 id="org42ffd0a">13.1.2</h3>
<div class="outline-text-3" id="text-org42ffd0a">
<p>
标准库通常要求保存在容器中的类型要具有赋值运算符，且返回值是左侧运算对象的引用。
</p>

<p>
在一个析构函数中，首先执行函数体，然后销毁成员，成员按照初始化顺序的逆序销毁。
</p>
</div>
</div>

<div id="outline-container-org4580328" class="outline-3">
<h3 id="org4580328">13.1.4</h3>
<div class="outline-text-3" id="text-org4580328">
<p>
程序的拷贝控制函数（拷贝构造，拷贝赋值，移动构造，移动赋值，析构函数）应该看作一个整体：只要需要定义其中一个，其他函数也需要定义。
</p>
</div>
</div>

<div id="outline-container-org5fd1981" class="outline-3">
<h3 id="org5fd1981">13.2.1</h3>
<div class="outline-text-3" id="text-org5fd1981">
<p>
赋值运算符通常组合了析构函数和构造函数的操作，应该是异常安全的。同时还要考虑到自赋值的情况。
</p>
</div>
</div>

<div id="outline-container-org94114ed" class="outline-3">
<h3 id="org94114ed">13.6 对象移动</h3>
<div class="outline-text-3" id="text-org94114ed">
<p>
对象移动的用处：
</p>
<ul class="org-ul">
<li>节省拷贝导致的内存消耗。</li>
<li>有些类不能拷贝，但是可以移动。例如IO类或者unique_ptr;</li>
</ul>
</div>
</div>
