content/reading-note/c++-primer-notes.org
** 13.6.1 右值引用
   右值引用要么字面常量，要么是将要销毁的对象。

   变量是左值，所以不能将右值引用绑定到一个右值引用的变量上。

   不能对移动后源对象做任何假设，这是为什么？

   可以销毁一个移后源对象，也可以赋予它值，但不能使用一个移后源对象的值。 这是为什么？

   一旦移动完成，源对象必须不再指向被移动的资源，这些资源的所有权已经归属新创建的对象。

   noexcept 指明函数不会抛出异常。如果不指定，在内存分配过程中就会使用拷贝构造函数而不是移动构造函数。

   移动操作完成后，源对象会被销毁。必须保证移后源对象进入一个可析构的状态。

   此外，移动操作还必须保证对象仍然是有效的。另一方面，移动操作对移后源对象中留下的值没有任何要求。因此，我们不应该依赖于移后源对象中的数据。

   如果一个类定义了自己的拷贝构造函数、拷贝赋值运算符或者析构函数，编译器就不会为它合成移动构造函数和移动操作符了。

   只有当一个类没有定义自己版本的拷贝控制成员，且类的每个非 static 数据成员都可以移动时，编译器才会为它合成移动构造函数或移动操作符。

   如果类定义了一个移动构造函数和/或一个移动赋值运算符，则该类的合成拷贝函数和拷贝赋值运算符会被定义为删除的。所以，定义类移动构造函数或移动赋值操作符的类也必须定义自己的拷贝操作符。否则，这些成员默认的被定义为删除的。

* 第 14 章 重载运算与类型转换
** 基本概念
** 输入和输出运算符
** 算术和关系运算符
** 赋值运算符
** 下标运算符
** 递增和递减运算符
** 成员访问运算符
** 函数调用运算符
** 重载、类型转换与运算符
* 第 15 章 面向对象程序设计
** 15.1
   面向对象程序设计的核心思想是数据抽象、继承和动态绑定。通过使用数据抽象，可以将类的接口于实现分离；使用继承，可以定义相似的类型并对其相似关系建模；使用动态绑定，可以在一定程度上忽略相似类型的区别，而以同意的方式使用它们的对象。

   基类将希望派生类各自定义的函数声明为虚函数。

   派生类必须在其内部对 *所有重新定义* 的虚函数进行 *声明* 。

   当使用基类的引用（指针）调用一个虚函数时将发生动态绑定。

** 15.2.1

   任何构造函数之外的非静态函数都可以是虚函数。

   构造函数为什么不能是虚函数？[fn:3]

   静态函数为什么不能是虚函数？

   基类的虚函数在派生类中隐式的也是虚函数。

   为什么会有 protect 关键字？因为派生类 *可以继承* 定义在基类中的成员，但是派生类 *不一定有权访问* 从基类继承而来的成员。和其他使用基类的代码一样，派生类能访问共有成员，但是不能访问私有成员。但是有时候希望能够有些成员派生类可以访问，但外部代码不能访问，所以才有 protect。

** 15.2.2
   派生类访问说明符是控制派生类从基类继承来的成员是否对 *派生类的用户* 可见。

   派生类必须使用基类的构造函数来初始化它的基类部分。

   派生类可以访问基类的公有成员和保护成员。

   final 关键字用于防止继承发生。

** 15.3
   当且仅当通过基类的指针或引用调用虚函数时会发生动态绑定。

   引用和指针的静态类型与动态类型不同这一事实正是 C++语言支持多态性的根本所在。

   使用 override 关键字表明派生类覆盖了基类函数。

   虚函数调用的默认实参由本次调用的静态类型决定，所以虚函数如果使用默认实参，最好基类和派生类中的默认实参保持一致。（为什么？如果不一致，派生列中的函数将隐藏基类的中同名函数，就无法通过类的引用或指针调用派生类的虚函数）

   使用作用域操作符强制调用指定版本的虚函数。

** 15.4 抽象基类

   可以为纯虚函数提供定义，不过函数体必须定义在类的外部。

** 15.5 访问控制和继承
   派生类的成员或友元只能通过 *派生类对象* 来访问基类的受保护成员。派生类对于一个 *基类对象* 中的受保护成员没有任何访问特权。否则，只需要定义基类的使用者只需要定义派生类，就可以绕过 protect 关键字。

   对基类成员的访问权限只与基类中的访问说明符有关。

   派生访问说明符的目的是控制 *派生类用户* （包括派生类的派生类）对于基类成员的访问。

   友元关系既不能传递，也不能继承。

   使用 using 语句修改个别成员的可访问性。

   struct 和 class 关键字唯一的差别就是 默认成员访问说明符以及默认派生访问说明符，除此之外，别无不同。

** 15.6 继承中的作用域

   对象、指针、引用的静态类型决定了对象的哪些成员是可见的。

   如果派生类的成员与基类成员的某个成员同名，则派生类将 *在其作用域内* 隐藏该基类成员，即使二者的形参列表不同。

   使用 using 声明语句，把函数的所有重载实例添加派生类的作用域中。
** 15.7.1 虚析构函数
   虚析构函数将阻止合成而移动操作。

** 15.7.2 合成拷贝控制与继承
   派生类析构函数除了销毁自身成员，还销毁派生类的直接基类。

** 15.7.3
   默认情况下，基类默认构造函数初始化派生类的基类部分。如果想要 *拷贝（或移动）* 基类部分，则必须在派生类的构造函数列表中显式使用基类的拷贝（或移动）构造函数。

   如果构造函数或析构函数调用了某个虚函数，则应该是执行与构造函数或析构函数所属类型相对应的虚函数版本。

** 15.7.4 继承的构造函数
   当 using 作用于构造函数时，using 声明语句将令比哪一期产生代码。对于积累的构造函数，编译器都生成一个与之对应的派生类构造函数。
* 第 16 章 模板与泛型编程
* 第 17 章 标准库特殊设施
* 第 18 章 用于大型程序的工具
** 异常处理
** 命名空间
   #+BEGIN_SRC c++ :tangle c++-primer/test_namespace.cc
      #include <gtest\gtest.h>

      //测试命名空间
      namespace phenix3443 {
          namespace NS {
              class Quote { };
              void display (Quote&) { std::cout << "function in ns namespace" << std::endl; }
          }
          TEST (TestNameSpace, TestFunctionFind) {
              //测试嵌套命名空间中函数蚕食是类对象的查找过程。
              display (NS::Quote ());
          }

          namespace A { int i = 0, j = 0; }
          int f () {
              int i = 1;
              using namespace A;
              std::cout << "f() i = " << i << std::endl;
              return i;
          }
          int g () {
              using A::i;
              std::cout << "g() i = " << i << std::endl;
              return i;
          }
          TEST (TestNameSpace, TestUsing) {
              //测试using声明和using指示作用域的差别
              EXPECT_EQ (1, f ());
              EXPECT_EQ (0, g ());
          }
      }
   #+END_SRC
** 18.3.1 多重继承
   基类的构造顺序与派生类列表中基类的出现顺序一直，而与派生类构造函数初始值列表中基类的顺序无关。
** 18.3.2
** 18.3.3 多重继承下的类作用域
   在多重继承的情况下，相同的查找过程在所有直接基类中 *同时进行* 。如果名字在多个基类中被找到，则对该名字的使用具有二异性。
** 18.3.4 虚继承
   通过虚继承，解决派生类的继承链上有一个基类的多子对象的问题。其中共享的基类对象被称为虚基类。

   如果虚基类的成员只被一条派生路径覆盖，则我们仍然可以访问这个被覆盖的成员。但是如果成员被多于一个基类覆盖，则一般情况下，派生类必须为该成员自定义个一个新的版本。

** 15.3.5 构造函数与虚继承
   虚基类是由最低层的派生类初始化的：首先使用提供给最低层派生类构造函数的初始值初始化该对象的虚基类子部分，接下来按照基类在派生列表中出现的次序一次对其进行初始化。

   一个类可以有多个虚基类。此时，这些虚的子对象按照它们在派生列表中出现的顺序从左向依次构造。
* 第 19 章 特殊工具与技术
** 控制内存分配
