reading-note/c++-primer-notes.html


<div id="outline-container-orgf656475" class="outline-3">
<h3 id="orgf656475">13.6.1 右值引用</h3>
<div class="outline-text-3" id="text-orgf656475">
<p>
右值引用要么字面常量，要么是将要销毁的对象。
</p>

<p>
变量是左值，所以不能将右值引用绑定到一个右值引用的变量上。
</p>

<p>
不能对移动后源对象做任何假设，这是为什么？
</p>

<p>
可以销毁一个移后源对象，也可以赋予它值，但不能使用一个移后源对象的值。 这是为什么？
</p>

<p>
一旦移动完成，源对象必须不再指向被移动的资源，这些资源的所有权已经归属新创建的对象。
</p>

<p>
noexcept指明函数不会抛出异常。如果不指定，在内存分配过程中就会使用拷贝构造函数而不是移动构造函数。
</p>

<p>
移动操作完成后，源对象会被销毁。必须保证移后源对象进入一个可析构的状态。
</p>

<p>
此外，移动操作还必须保证对象仍然是有效的。另一方面，移动操作对移后源对象中留下的值没有任何要求。因此，我们不应该依赖于移后源对象中的数据。
</p>

<p>
如果一个类定义了自己的拷贝构造函数、拷贝赋值运算符或者析构函数，编译器就不会为它合成移动构造函数和移动操作符了。
</p>

<p>
只有当一个类没有定义自己版本的拷贝控制成员，且类的每个非static数据成员都可以移动时，编译器才会为它合成移动构造函数或移动操作符。
</p>

<p>
如果类定义了一个移动构造函数和/或一个移动赋值运算符，则该类的合成拷贝函数和拷贝赋值运算符会被定义为删除的。所以，定义类移动构造函数或移动赋值操作符的类也必须定义自己的拷贝操作符。否则，这些成员默认的被定义为删除的。
</p>
</div>
</div>
</div>

<div id="outline-container-org4f4dbf9" class="outline-2">
<h2 id="org4f4dbf9">第14章 重载运算与类型转换</h2>
<div class="outline-text-2" id="text-org4f4dbf9">
</div>
<div id="outline-container-org9e1e632" class="outline-3">
<h3 id="org9e1e632">基本概念</h3>
</div>
<div id="outline-container-org48cdd36" class="outline-3">
<h3 id="org48cdd36">输入和输出运算符</h3>
</div>
<div id="outline-container-org39af74e" class="outline-3">
<h3 id="org39af74e">算术和关系运算符</h3>
</div>
<div id="outline-container-orgf9a9941" class="outline-3">
<h3 id="orgf9a9941">赋值运算符</h3>
</div>
<div id="outline-container-orgaf9601c" class="outline-3">
<h3 id="orgaf9601c">下标运算符</h3>
</div>
<div id="outline-container-org4e30aae" class="outline-3">
<h3 id="org4e30aae">递增和递减运算符</h3>
</div>
<div id="outline-container-orgf485b7d" class="outline-3">
<h3 id="orgf485b7d">成员访问运算符</h3>
</div>
<div id="outline-container-org521e03b" class="outline-3">
<h3 id="org521e03b">函数调用运算符</h3>
</div>
<div id="outline-container-org211725b" class="outline-3">
<h3 id="org211725b">重载、类型转换与运算符</h3>
</div>
</div>
<div id="outline-container-orgbc9ef34" class="outline-2">
<h2 id="orgbc9ef34">第15章 面向对象程序设计</h2>
<div class="outline-text-2" id="text-orgbc9ef34">
</div>
<div id="outline-container-org4654d70" class="outline-3">
<h3 id="org4654d70">15.1</h3>
<div class="outline-text-3" id="text-org4654d70">
<p>
面向对象程序设计的核心思想是数据抽象、继承和动态绑定。通过使用数据抽象，可以将类的接口于实现分离；使用继承，可以定义相似的类型并对其相似关系建模；使用动态绑定，可以在一定程度上忽略相似类型的区别，而以同意的方式使用它们的对象。
</p>

<p>
基类将希望派生类各自定义的函数声明为虚函数。
</p>

<p>
派生类必须在其内部对 <b>所有重新定义</b> 的虚函数进行 <b>声明</b> 。
</p>

<p>
当使用基类的引用（指针）调用一个虚函数时将发生动态绑定。
</p>
</div>
</div>

<div id="outline-container-org90b860e" class="outline-3">
<h3 id="org90b860e">15.2.1</h3>
<div class="outline-text-3" id="text-org90b860e">
<p>
任何构造函数之外的非静态函数都可以是虚函数。
</p>

<p>
构造函数为什么不能是虚函数？<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>
</p>

<p>
静态函数为什么不能是虚函数？
</p>

<p>
基类的虚函数在派生类中隐式的也是虚函数。
</p>

<p>
为什么会有protect关键字？因为派生类 <b>可以继承</b> 定义在基类中的成员，但是派生类 <b>不一定有权访问</b> 从基类继承而来的成员。和其他使用基类的代码一样，派生类能访问共有成员，但是不能访问私有成员。但是有时候希望能够有些成员派生类可以访问，但外部代码不能访问，所以才有protect。
</p>
</div>
</div>

<div id="outline-container-org63389a6" class="outline-3">
<h3 id="org63389a6">15.2.2</h3>
<div class="outline-text-3" id="text-org63389a6">
<p>
派生类访问说明符是控制派生类从基类继承来的成员是否对 <b>派生类的用户</b> 可见。
</p>

<p>
派生类必须使用基类的构造函数来初始化它的基类部分。
</p>

<p>
派生类可以访问基类的公有成员和保护成员。
</p>

<p>
final关键字用于防止继承发生。
</p>
</div>
</div>

<div id="outline-container-org6129bee" class="outline-3">
<h3 id="org6129bee">15.3</h3>
<div class="outline-text-3" id="text-org6129bee">
<p>
当且仅当通过基类的指针或引用调用虚函数时会发生动态绑定。
</p>

<p>
引用和指针的静态类型与动态类型不同这一事实正是C++语言支持多态性的根本所在。
</p>

<p>
使用override关键字表明派生类覆盖了基类函数。
</p>

<p>
虚函数调用的默认实参由本次调用的静态类型决定，所以虚函数如果使用默认实参，最好基类和派生类中的默认实参保持一致。（为什么？如果不一致，派生列中的函数将隐藏基类的中同名函数，就无法通过类的引用或指针调用派生类的虚函数）
</p>

<p>
使用作用域操作符强制调用指定版本的虚函数。
</p>
</div>
</div>

<div id="outline-container-orgc9a5cb4" class="outline-3">
<h3 id="orgc9a5cb4">15.4 抽象基类</h3>
<div class="outline-text-3" id="text-orgc9a5cb4">
<p>
可以为纯虚函数提供定义，不过函数体必须定义在类的外部。
</p>
</div>
</div>

<div id="outline-container-orgf1f6152" class="outline-3">
<h3 id="orgf1f6152">15.5 访问控制和继承</h3>
<div class="outline-text-3" id="text-orgf1f6152">
<p>
派生类的成员或友元只能通过 <b>派生类对象</b> 来访问基类的受保护成员。派生类对于一个 <b>基类对象</b> 中的受保护成员没有任何访问特权。否则，只需要定义基类的使用者只需要定义派生类，就可以绕过protect关键字。
</p>

<p>
对基类成员的访问权限只与基类中的访问说明符有关。
</p>

<p>
派生访问说明符的目的是控制 <b>派生类用户</b> （包括派生类的派生类）对于基类成员的访问。
</p>

<p>
友元关系既不能传递，也不能继承。
</p>

<p>
使用using语句修改个别成员的可访问性。
</p>

<p>
struct和class关键字唯一的差别就是 默认成员访问说明符以及默认派生访问说明符，除此之外，别无不同。
</p>
</div>
</div>

<div id="outline-container-org7ad6ea0" class="outline-3">
<h3 id="org7ad6ea0">15.6 继承中的作用域</h3>
<div class="outline-text-3" id="text-org7ad6ea0">
<p>
对象、指针、引用的静态类型决定了对象的哪些成员是可见的。
</p>

<p>
如果派生类的成员与基类成员的某个成员同名，则派生类将 <b>在其作用域内</b> 隐藏该基类成员，即使二者的形参列表不同。
</p>

<p>
使用using声明语句，把函数的所有重载实例添加派生类的作用域中。
</p>
</div>
</div>
<div id="outline-container-orgd5eccf8" class="outline-3">
<h3 id="orgd5eccf8">15.7.1 虚析构函数</h3>
<div class="outline-text-3" id="text-orgd5eccf8">
<p>
虚析构函数将阻止合成而移动操作。
</p>
</div>
</div>

<div id="outline-container-org5458f99" class="outline-3">
<h3 id="org5458f99">15.7.2 合成拷贝控制与继承</h3>
<div class="outline-text-3" id="text-org5458f99">
<p>
派生类析构函数除了销毁自身成员，还销毁派生类的直接基类。
</p>
</div>
</div>

<div id="outline-container-org09f9863" class="outline-3">
<h3 id="org09f9863">15.7.3</h3>
<div class="outline-text-3" id="text-org09f9863">
<p>
默认情况下，基类默认构造函数初始化派生类的基类部分。如果想要 <b>拷贝（或移动）</b> 基类部分，则必须在派生类的构造函数列表中显式使用基类的拷贝（或移动）构造函数。
</p>

<p>
如果构造函数或析构函数调用了某个虚函数，则应该是执行与构造函数或析构函数所属类型相对应的虚函数版本。
</p>
</div>
</div>

<div id="outline-container-org5f6fdad" class="outline-3">
<h3 id="org5f6fdad">15.7.4 继承的构造函数</h3>
<div class="outline-text-3" id="text-org5f6fdad">
<p>
当using作用于构造函数时，using声明语句将令比哪一期产生代码。对于积累的构造函数，编译器都生成一个与之对应的派生类构造函数。
</p>
</div>
</div>
</div>
<div id="outline-container-org93d449e" class="outline-2">
<h2 id="org93d449e">第16章 模板与泛型编程</h2>
</div>
<div id="outline-container-orgff15b4f" class="outline-2">
<h2 id="orgff15b4f">第17章 标准库特殊设施</h2>
</div>
<div id="outline-container-org664a53f" class="outline-2">
<h2 id="org664a53f">第18章 用于大型程序的工具</h2>
<div class="outline-text-2" id="text-org664a53f">
</div>
<div id="outline-container-orgcdab539" class="outline-3">
<h3 id="orgcdab539">异常处理</h3>
</div>
<div id="outline-container-org5deac72" class="outline-3">
<h3 id="org5deac72">命名空间</h3>
<div class="outline-text-3" id="text-org5deac72">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #d18aff;">      #include</span> <span style="color: #ff4ea3;">&lt;gtest\gtest.h&gt;</span>

      <span style="color: #6c6c6c; font-style: italic;">//</span><span style="color: #6c6c6c; font-style: italic;">&#27979;&#35797;&#21629;&#21517;&#31354;&#38388;</span>
      <span style="color: #a1db00;">namespace</span> <span style="color: #5fafd7;">phenix3443</span> {
          <span style="color: #a1db00;">namespace</span> <span style="color: #5fafd7;">NS</span> {
              <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">Quote</span> { };
              <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">display</span> (<span style="color: #00d7af;">Quote</span>&amp;) { <span style="color: #5fafd7;">std</span>::cout &lt;&lt; <span style="color: #ff4ea3;">"function in ns namespace"</span> &lt;&lt; <span style="color: #5fafd7;">std</span>::endl; }
          }
          <span style="color: #ffd700;">TEST</span> (TestNameSpace, TestFunctionFind) {
              <span style="color: #6c6c6c; font-style: italic;">//</span><span style="color: #6c6c6c; font-style: italic;">&#27979;&#35797;&#23884;&#22871;&#21629;&#21517;&#31354;&#38388;&#20013;&#20989;&#25968;&#34453;&#39135;&#26159;&#31867;&#23545;&#35937;&#30340;&#26597;&#25214;&#36807;&#31243;&#12290;</span>
              display (<span style="color: #5fafd7;">NS</span>::Quote ());
          }

          <span style="color: #a1db00;">namespace</span> <span style="color: #5fafd7;">A</span> { <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">i</span> = 0, <span style="color: #ff8700;">j</span> = 0; }
          <span style="color: #00d7af;">int</span> <span style="color: #ffd700;">f</span> () {
              <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">i</span> = 1;
              <span style="color: #a1db00;">using</span> <span style="color: #a1db00;">namespace</span> <span style="color: #5fafd7;">A</span>;
              <span style="color: #5fafd7;">std</span>::cout &lt;&lt; <span style="color: #ff4ea3;">"f() i = "</span> &lt;&lt; i &lt;&lt; <span style="color: #5fafd7;">std</span>::endl;
              <span style="color: #a1db00;">return</span> i;
          }
          <span style="color: #00d7af;">int</span> <span style="color: #ffd700;">g</span> () {
              <span style="color: #a1db00;">using</span> <span style="color: #5fafd7;">A</span>::<span style="color: #00d7af;">i</span>;
              <span style="color: #5fafd7;">std</span>::cout &lt;&lt; <span style="color: #ff4ea3;">"g() i = "</span> &lt;&lt; i &lt;&lt; <span style="color: #5fafd7;">std</span>::endl;
              <span style="color: #a1db00;">return</span> i;
          }
          <span style="color: #ffd700;">TEST</span> (TestNameSpace, TestUsing) {
              <span style="color: #6c6c6c; font-style: italic;">//</span><span style="color: #6c6c6c; font-style: italic;">&#27979;&#35797;using&#22768;&#26126;&#21644;using&#25351;&#31034;&#20316;&#29992;&#22495;&#30340;&#24046;&#21035;</span>
              EXPECT_EQ (1, f ());
              EXPECT_EQ (0, g ());
          }
      }
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc82d8c9" class="outline-3">
<h3 id="orgc82d8c9">18.3.1 多重继承</h3>
<div class="outline-text-3" id="text-orgc82d8c9">
<p>
基类的构造顺序与派生类列表中基类的出现顺序一直，而与派生类构造函数初始值列表中基类的顺序无关。
</p>
</div>
</div>
<div id="outline-container-org8781e73" class="outline-3">
<h3 id="org8781e73">18.3.2</h3>
</div>
<div id="outline-container-orgdb89064" class="outline-3">
<h3 id="orgdb89064">18.3.3 多重继承下的类作用域</h3>
<div class="outline-text-3" id="text-orgdb89064">
<p>
在多重继承的情况下，相同的查找过程在所有直接基类中 <b>同时进行</b> 。如果名字在多个基类中被找到，则对该名字的使用具有二异性。
</p>
</div>
</div>
<div id="outline-container-org97cda69" class="outline-3">
<h3 id="org97cda69">18.3.4 虚继承</h3>
<div class="outline-text-3" id="text-org97cda69">
<p>
通过虚继承，解决派生类的继承链上有一个基类的多子对象的问题。其中共享的基类对象被称为虚基类。
</p>

<p>
如果虚基类的成员只被一条派生路径覆盖，则我们仍然可以访问这个被覆盖的成员。但是如果成员被多于一个基类覆盖，则一般情况下，派生类必须为该成员自定义个一个新的版本。
</p>
</div>
</div>

<div id="outline-container-orgda8bcf6" class="outline-3">
<h3 id="orgda8bcf6">15.3.5 构造函数与虚继承</h3>
<div class="outline-text-3" id="text-orgda8bcf6">
<p>
虚基类是由最低层的派生类初始化的：首先使用提供给最低层派生类构造函数的初始值初始化该对象的虚基类子部分，接下来按照基类在派生列表中出现的次序一次对其进行初始化。
</p>

<p>
一个类可以有多个虚基类。此时，这些虚的子对象按照它们在派生列表中出现的顺序从左向依次构造。
</p>
</div>
</div>
</div>
