content/reading-note/c++-primer-notes.org
*** 定位 new 修改内存数据
    #+BEGIN_SRC c++ :tangle interview-code/test_new.cc
      #include <iostream>
      #include <gtest\gtest.h>

      //测试new和delete
      namespace phenix3443 {
          TEST (NewDelete, PlaceNew) {
              //测试定位new修改制定内存数据
              int a = 10;
              int* ps = new(&a) int (20);
              EXPECT_EQ (20, a);
          }
      }
    #+END_SRC
** 运行时类型识别
   #+BEGIN_SRC c++ :tangle c++-primer/test_RTTI.cc
      #include <iostream>
      #include <gtest\gtest.h>

      //测试RTTI,通过RTTI如何定义类的相等操作。
      namespace phenix3443 {
          class Base {
          public:
              Base (int i = 0) :b_ (i) { }
          protected:
              virtual bool Equal (Base& rsh) { return b_ == rsh.b_; }
          private:
              int b_;

              friend bool operator== (Base& a, Base& b);
          };
          class Derived : public Base {
          public:
              Derived (int j=1) :d_ (j) { }
          protected:
              virtual bool Equal (Base& rsh) {
                  Derived& tmp = dynamic_cast<Derived&>(rsh);
                  return d_ == tmp.d_;
              }
          private:
              int d_;
          };
          bool operator==(Base& a, Base& b) {
              return (typeid(a) == typeid(b) && a.Equal (b));
          }

          TEST (TestRTTI, ClassEqual) {
              Base b;
              Derived d1, d2;
              std::cout << "Class Base's name is " << typeid(b).name() << std::endl;
              std::cout << "Class Derive's name is " << typeid(d1).name() << std::endl;
              EXPECT_TRUE (typeid(b).before (typeid(d1)));
              EXPECT_FALSE (b == d1);
              EXPECT_TRUE(d1 == d2);
              Base& br = d1;
              EXPECT_TRUE (br == d1);
          }
      }
   #+END_SRC
** 枚举类型
