reading-note/c++-primer-notes.html
<div id="outline-container-org441f90d" class="outline-2">
<h2 id="org441f90d">第19章 特殊工具与技术</h2>
<div class="outline-text-2" id="text-org441f90d">
</div>
<div id="outline-container-org20d28d3" class="outline-3">
<h3 id="org20d28d3">控制内存分配</h3>
<div class="outline-text-3" id="text-org20d28d3">
</div>
<div id="outline-container-org88ad137" class="outline-4">
<h4 id="org88ad137">定位new修改内存数据</h4>
<div class="outline-text-4" id="text-org88ad137">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #d18aff;">      #include</span> <span style="color: #ff4ea3;">&lt;iostream&gt;</span>
<span style="color: #d18aff;">      #include</span> <span style="color: #ff4ea3;">&lt;gtest\gtest.h&gt;</span>

      <span style="color: #6c6c6c; font-style: italic;">//</span><span style="color: #6c6c6c; font-style: italic;">&#27979;&#35797;new&#21644;delete</span>
      <span style="color: #a1db00;">namespace</span> <span style="color: #5fafd7;">phenix3443</span> {
          <span style="color: #ffd700;">TEST</span> (NewDelete, PlaceNew) {
              <span style="color: #6c6c6c; font-style: italic;">//</span><span style="color: #6c6c6c; font-style: italic;">&#27979;&#35797;&#23450;&#20301;new&#20462;&#25913;&#21046;&#23450;&#20869;&#23384;&#25968;&#25454;</span>
              <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">a</span> = 10;
              <span style="color: #00d7af;">int</span>* <span style="color: #ff8700;">ps</span> = <span style="color: #a1db00;">new</span>(&amp;a) <span style="color: #00d7af;">int</span> (20);
              EXPECT_EQ (20, a);
          }
      }
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga407e9d" class="outline-3">
<h3 id="orga407e9d">运行时类型识别</h3>
<div class="outline-text-3" id="text-orga407e9d">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #d18aff;">      #include</span> <span style="color: #ff4ea3;">&lt;iostream&gt;</span>
<span style="color: #d18aff;">      #include</span> <span style="color: #ff4ea3;">&lt;gtest\gtest.h&gt;</span>

      <span style="color: #6c6c6c; font-style: italic;">//</span><span style="color: #6c6c6c; font-style: italic;">&#27979;&#35797;RTTI,&#36890;&#36807;RTTI&#22914;&#20309;&#23450;&#20041;&#31867;&#30340;&#30456;&#31561;&#25805;&#20316;&#12290;</span>
      <span style="color: #a1db00;">namespace</span> <span style="color: #5fafd7;">phenix3443</span> {
          <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">Base</span> {
          <span style="color: #a1db00;">public</span>:
              <span style="color: #ffd700;">Base</span> (<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">i</span> = 0) :b_ (i) { }
          <span style="color: #a1db00;">protected</span>:
              <span style="color: #a1db00;">virtual</span> <span style="color: #00d7af;">bool</span> <span style="color: #ffd700;">Equal</span> (<span style="color: #00d7af;">Base</span>&amp; <span style="color: #ff8700;">rsh</span>) { <span style="color: #a1db00;">return</span> b_ == rsh.b_; }
          <span style="color: #a1db00;">private</span>:
              <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">b_</span>;

              <span style="color: #a1db00;">friend</span> <span style="color: #00d7af;">bool</span> <span style="color: #a1db00;">operator</span><span style="color: #ffd700;">==</span> (<span style="color: #00d7af;">Base</span>&amp; <span style="color: #ff8700;">a</span>, <span style="color: #00d7af;">Base</span>&amp; <span style="color: #ff8700;">b</span>);
          };
          <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">Derived</span> : <span style="color: #a1db00;">public</span> <span style="color: #00d7af;">Base</span> {
          <span style="color: #a1db00;">public</span>:
              <span style="color: #ffd700;">Derived</span> (<span style="color: #00d7af;">int</span> <span style="color: #ff8700;">j</span>=1) :d_ (j) { }
          <span style="color: #a1db00;">protected</span>:
              <span style="color: #a1db00;">virtual</span> <span style="color: #00d7af;">bool</span> <span style="color: #ffd700;">Equal</span> (<span style="color: #00d7af;">Base</span>&amp; <span style="color: #ff8700;">rsh</span>) {
                  <span style="color: #00d7af;">Derived</span>&amp; <span style="color: #ff8700;">tmp</span> = <span style="color: #a1db00;">dynamic_cast</span>&lt;<span style="color: #00d7af;">Derived</span>&amp;&gt;(rsh);
                  <span style="color: #a1db00;">return</span> d_ == tmp.d_;
              }
          <span style="color: #a1db00;">private</span>:
              <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">d_</span>;
          };
          <span style="color: #00d7af;">bool</span> <span style="color: #a1db00;">operator</span><span style="color: #ffd700;">==</span>(<span style="color: #00d7af;">Base</span>&amp; <span style="color: #ff8700;">a</span>, <span style="color: #00d7af;">Base</span>&amp; <span style="color: #ff8700;">b</span>) {
              <span style="color: #a1db00;">return</span> (<span style="color: #a1db00;">typeid</span>(a) == <span style="color: #a1db00;">typeid</span>(b) &amp;&amp; a.Equal (b));
          }

          <span style="color: #ffd700;">TEST</span> (TestRTTI, ClassEqual) {
              <span style="color: #00d7af;">Base</span> <span style="color: #ff8700;">b</span>;
              <span style="color: #00d7af;">Derived</span> <span style="color: #ff8700;">d1</span>, <span style="color: #ff8700;">d2</span>;
              <span style="color: #5fafd7;">std</span>::cout &lt;&lt; <span style="color: #ff4ea3;">"Class Base's name is "</span> &lt;&lt; <span style="color: #a1db00;">typeid</span>(b).name() &lt;&lt; <span style="color: #5fafd7;">std</span>::endl;
              <span style="color: #5fafd7;">std</span>::cout &lt;&lt; <span style="color: #ff4ea3;">"Class Derive's name is "</span> &lt;&lt; <span style="color: #a1db00;">typeid</span>(d1).name() &lt;&lt; <span style="color: #5fafd7;">std</span>::endl;
              EXPECT_TRUE (<span style="color: #a1db00;">typeid</span>(b).before (<span style="color: #a1db00;">typeid</span>(d1)));
              EXPECT_FALSE (b == d1);
              EXPECT_TRUE(d1 == d2);
              <span style="color: #00d7af;">Base</span>&amp; <span style="color: #ff8700;">br</span> = d1;
              EXPECT_TRUE (br == d1);
          }
      }
</pre>
</div>
</div>
</div>
