content/reading-note/c++-primer-notes.org
** 类成员指针
   #+BEGIN_SRC c++ :tangle c++-primer/class_mem_point.cc
      //测试函数成员指针
      namespace phenix3443 {
          class Screen {
          public:
              Screen () { }
              Screen (const std::initializer_list<std::string>& il) :content_ (il) { }
              char get () const {
                  return content_[cursor_[0]][cursor_[1]];
              }
              Screen& Home () {
                  cursor_ = { 0,0 };
                  return *this;
              }
              Screen& End () {
                  cursor_ = { content_.size () - 1,content_.back ().size () - 1 };
                  return *this;
              }
              Screen& Forward () {
                  if ( cursor_[1] < content_[cursor_[0]].size () - 1 ) {
                      ++cursor_[1];
                  }
                  else {
                      if ( cursor_[0] < content_.size () - 1 ) {
                          ++cursor_[0];
                          cursor_[1] = 0;
                      }
                  }
                  return *this;
              }
              Screen& Back () {
                  if ( cursor_[1] > 0 ) {
                      --cursor_[1];
                  }
                  else {
                      if ( cursor_[0] > 0 ) {
                          --cursor_[0];
                          cursor_[1] = content_[cursor_[0]].size () - 1;
                      }
                  }
                  return *this;
              }
              enum Direction { HOME, FORWARD, BACK, END };
              using Action = Screen& (Screen::*)();
              Screen& Move (Direction d) {
                  return (this->*menu_[d])();
              }
          private:
              std::vector<std::string> content_;
              std::array<size_t, 2> cursor_ = { 0,0 };
              static Action menu_[];
          };
          Screen::Action Screen::menu_[] = { &Screen::Home,&Screen::Forward,&Screen::Back,&Screen::End };

          TEST (ClassMemPoint, ScreenTest) {
              Screen text = { "first","second","third" };
              EXPECT_EQ ('f', text.get ());
              text.Move (Screen::FORWARD);
              EXPECT_EQ ('i', text.get ());
          }
      }
   #+END_SRC
** 嵌套类
** union
** 局部类
** 固有的不可移植的特性
* Footnotes

[fn:1] [[http://coolshell.cn/articles/7459.html][Huffman 编码压缩算法]]

[fn:1] [[http://blog.csdn.net/chenyiming_1990/article/details/9933109][C语言浮点数解惑]]

[fn:2] [[https://www.zhihu.com/question/34267829][C++中引用有什么用]]

[fn:3] https://www.zhihu.com/question/35632207
