reading-note/c++-primer-notes.html
<div id="outline-container-orgbdd4e07" class="outline-3">
<h3 id="orgbdd4e07">枚举类型</h3>
</div>
<div id="outline-container-orgb4d2f01" class="outline-3">
<h3 id="orgb4d2f01">类成员指针</h3>
<div class="outline-text-3" id="text-orgb4d2f01">
<div class="org-src-container">
<pre class="src src-c++">      <span style="color: #6c6c6c; font-style: italic;">//</span><span style="color: #6c6c6c; font-style: italic;">&#27979;&#35797;&#20989;&#25968;&#25104;&#21592;&#25351;&#38024;</span>
      <span style="color: #a1db00;">namespace</span> <span style="color: #5fafd7;">phenix3443</span> {
          <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">Screen</span> {
          <span style="color: #a1db00;">public</span>:
              <span style="color: #ffd700;">Screen</span> () { }
              <span style="color: #ffd700;">Screen</span> (<span style="color: #a1db00;">const</span> <span style="color: #5fafd7;">std</span>::<span style="color: #00d7af;">initializer_list</span>&lt;<span style="color: #5fafd7;">std</span>::string&gt;&amp; <span style="color: #ff8700;">il</span>) :content_ (il) { }
              <span style="color: #00d7af;">char</span> <span style="color: #ffd700;">get</span> () <span style="color: #a1db00;">const</span> {
                  <span style="color: #a1db00;">return</span> content_[cursor_[0]][cursor_[1]];
              }
              <span style="color: #00d7af;">Screen</span>&amp; <span style="color: #ffd700;">Home</span> () {
                  cursor_ = { 0,0 };
                  <span style="color: #a1db00;">return</span> *<span style="color: #a1db00;">this</span>;
              }
              <span style="color: #00d7af;">Screen</span>&amp; <span style="color: #ffd700;">End</span> () {
                  cursor_ = { content_.size () - 1,content_.back ().size () - 1 };
                  <span style="color: #a1db00;">return</span> *<span style="color: #a1db00;">this</span>;
              }
              <span style="color: #00d7af;">Screen</span>&amp; <span style="color: #ffd700;">Forward</span> () {
                  <span style="color: #a1db00;">if</span> ( cursor_[1] &lt; content_[cursor_[0]].size () - 1 ) {
                      ++cursor_[1];
                  }
                  <span style="color: #a1db00;">else</span> {
                      <span style="color: #a1db00;">if</span> ( cursor_[0] &lt; content_.size () - 1 ) {
                          ++cursor_[0];
                          cursor_[1] = 0;
                      }
                  }
                  <span style="color: #a1db00;">return</span> *<span style="color: #a1db00;">this</span>;
              }
              <span style="color: #00d7af;">Screen</span>&amp; <span style="color: #ffd700;">Back</span> () {
                  <span style="color: #a1db00;">if</span> ( cursor_[1] &gt; 0 ) {
                      --cursor_[1];
                  }
                  <span style="color: #a1db00;">else</span> {
                      <span style="color: #a1db00;">if</span> ( cursor_[0] &gt; 0 ) {
                          --cursor_[0];
                          cursor_[1] = content_[cursor_[0]].size () - 1;
                      }
                  }
                  <span style="color: #a1db00;">return</span> *<span style="color: #a1db00;">this</span>;
              }
              <span style="color: #a1db00;">enum</span> <span style="color: #00d7af;">Direction</span> { <span style="color: #ff8700;">HOME</span>, <span style="color: #ff8700;">FORWARD</span>, <span style="color: #ff8700;">BACK</span>, <span style="color: #ff8700;">END</span> };
              <span style="color: #a1db00;">using</span> <span style="color: #00d7af;">Action</span> = Screen&amp; (<span style="color: #5fafd7;">Screen</span>::*)();
              <span style="color: #00d7af;">Screen</span>&amp; <span style="color: #ffd700;">Move</span> (<span style="color: #00d7af;">Direction</span> <span style="color: #ff8700;">d</span>) {
                  <span style="color: #a1db00;">return</span> (<span style="color: #a1db00;">this</span>-&gt;*menu_[d])();
              }
          <span style="color: #a1db00;">private</span>:
              <span style="color: #5fafd7;">std</span>::<span style="color: #00d7af;">vector</span>&lt;<span style="color: #5fafd7;">std</span>::string&gt; <span style="color: #ff8700;">content_</span>;
              <span style="color: #5fafd7;">std</span>::<span style="color: #00d7af;">array</span>&lt;<span style="color: #00d7af;">size_t</span>, 2&gt; <span style="color: #ff8700;">cursor_</span> = { 0,0 };
              <span style="color: #a1db00;">static</span> <span style="color: #00d7af;">Action</span> <span style="color: #ff8700;">menu_</span>[];
          };
          <span style="color: #5fafd7;">Screen</span>::<span style="color: #00d7af;">Action</span> <span style="color: #5fafd7;">Screen</span>::<span style="color: #ff8700;">menu_</span>[] = { &amp;<span style="color: #5fafd7;">Screen</span>::Home,&amp;<span style="color: #5fafd7;">Screen</span>::Forward,&amp;<span style="color: #5fafd7;">Screen</span>::Back,&amp;<span style="color: #5fafd7;">Screen</span>::End };

          <span style="color: #ffd700;">TEST</span> (ClassMemPoint, ScreenTest) {
              <span style="color: #00d7af;">Screen</span> <span style="color: #ff8700;">text</span> = { <span style="color: #ff4ea3;">"first"</span>,<span style="color: #ff4ea3;">"second"</span>,<span style="color: #ff4ea3;">"third"</span> };
              EXPECT_EQ (<span style="color: #ff4ea3;">'f'</span>, text.get ());
              text.Move (<span style="color: #5fafd7;">Screen</span>::FORWARD);
              EXPECT_EQ (<span style="color: #ff4ea3;">'i'</span>, text.get ());
          }
      }
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfa5def7" class="outline-3">
<h3 id="orgfa5def7">嵌套类</h3>
</div>
<div id="outline-container-org97b2422" class="outline-3">
<h3 id="org97b2422">union</h3>
</div>
<div id="outline-container-org99bf2fa" class="outline-3">
<h3 id="org99bf2fa">局部类</h3>
</div>
<div id="outline-container-org33a7dd2" class="outline-3">
<h3 id="org33a7dd2">固有的不可移植的特性</h3>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="http://coolshell.cn/articles/7459.html">Huffman 编码压缩算法</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.zhihu.com/question/34267829">C++中引用有什么用</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.zhihu.com/question/35632207">https://www.zhihu.com/question/35632207</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2019-09-10 二 19:59</p>
<p class="validation"></p>
</div>
</body>
</html>
